HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/**
 * @file      dw3000_deca_regs.h
 *
 * @brief     DW3000 Register Definitions
 *            This file supports Assembly and C development for DW3000 enabled devices
 *
 * @author    Decawave Applications
 *
 * @copyright SPDX-FileCopyrightText: Copyright (c) 2024 Qorvo US, Inc.
 *            SPDX-License-Identifier: LicenseRef-QORVO-2
 *
 */
#ifndef DECA_REGS_DW3000_H
#define DECA_REGS_DW3000_H

#ifdef __cplusplus
extern "C"
{
#endif

#include "dw3000_deca_vals.h"

/******************************************************************************
 * @brief Bit definitions for register DEV_ID
 **/
#define DEV_ID_ID                0x0UL
#define DEV_ID_LEN               (4U)
#define DEV_ID_MASK              0xFFFFFFFFUL
#define DEV_ID_RIDTAG_BIT_OFFSET (16U)
#define DEV_ID_RIDTAG_BIT_LEN    (16U)
#define DEV_ID_RIDTAG_BIT_MASK   0xffff0000UL
#define DEV_ID_MODEL_BIT_OFFSET  (8U)
#define DEV_ID_MODEL_BIT_LEN     (8U)
#define DEV_ID_MODEL_BIT_MASK    0xff00U
#define DEV_ID_VER_BIT_OFFSET    (4U)
#define DEV_ID_VER_BIT_LEN       (4U)
#define DEV_ID_VER_BIT_MASK      0xf0U
#define DEV_ID_REV_BIT_OFFSET    (0U)
#define DEV_ID_REV_BIT_LEN       (4U)
#define DEV_ID_REV_BIT_MASK      0xfU

/******************************************************************************
 * @brief Bit definitions for register EUI_64_LO
 **/
#define EUI_64_LO_ID                0x4UL
#define EUI_64_LO_LEN               (4U)
#define EUI_64_LO_MASK              0xFFFFFFFFUL
#define EUI_64_LO_EUI_64_BIT_OFFSET (0U)
#define EUI_64_LO_EUI_64_BIT_LEN    (32U)
#define EUI_64_LO_EUI_64_BIT_MASK   0xffffffffUL

/******************************************************************************
 * @brief Bit definitions for register EUI_64_HI
 **/
#define EUI_64_HI_ID                0x8UL
#define EUI_64_HI_LEN               (4U)
#define EUI_64_HI_MASK              0xFFFFFFFFUL
#define EUI_64_HI_EUI_64_BIT_OFFSET (0U)
#define EUI_64_HI_EUI_64_BIT_LEN    (32U)
#define EUI_64_HI_EUI_64_BIT_MASK   0xffffffffUL

/******************************************************************************
 * @brief Bit definitions for register PANADR
 **/
#define PANADR_ID                   0xCUL
#define PANADR_LEN                  (4U)
#define PANADR_MASK                 0xFFFFFFFFUL
#define PANADR_PAN_ID_BIT_OFFSET    (16U)
#define PANADR_PAN_ID_BIT_LEN       (16U)
#define PANADR_PAN_ID_BIT_MASK      0xffff0000UL
#define PANADR_SHORTADDR_BIT_OFFSET (0U)
#define PANADR_SHORTADDR_BIT_LEN    (16U)
#define PANADR_SHORTADDR_BIT_MASK   0xffffU

/******************************************************************************
 * @brief Bit definitions for register SYS_CFG
 **/
#define SYS_CFG_ID                     0x10UL
#define SYS_CFG_LEN                    (4U)
#define SYS_CFG_MASK                   0xFFFFFFFFUL
#define SYS_CFG_FAST_AAT_EN_BIT_OFFSET (18U)
#define SYS_CFG_FAST_AAT_EN_BIT_LEN    (1U)
#define SYS_CFG_FAST_AAT_EN_BIT_MASK   0x40000UL
#define SYS_CFG_PDOA_MODE_BIT_OFFSET   (16U)
#define SYS_CFG_PDOA_MODE_BIT_LEN      (2U)
#define SYS_CFG_PDOA_MODE_BIT_MASK     0x30000UL
#define SYS_CFG_CP_SDC_BIT_OFFSET      (15U)
#define SYS_CFG_CP_SDC_BIT_LEN         (1U)
#define SYS_CFG_CP_SDC_BIT_MASK        0x8000U
#define SYS_CFG_CP_SPC_BIT_OFFSET      (12U)
#define SYS_CFG_CP_SPC_BIT_LEN         (2U)
#define SYS_CFG_CP_SPC_BIT_MASK        0x3000U
#define SYS_CFG_AUTO_ACK_BIT_OFFSET    (11U)
#define SYS_CFG_AUTO_ACK_BIT_LEN       (1U)
#define SYS_CFG_AUTO_ACK_BIT_MASK      0x800U
#define SYS_CFG_RXAUTR_BIT_OFFSET      (10U)
#define SYS_CFG_RXAUTR_BIT_LEN         (1U)
#define SYS_CFG_RXAUTR_BIT_MASK        0x400UL
#define SYS_CFG_RXWTOE_BIT_OFFSET      (9U)
#define SYS_CFG_RXWTOE_BIT_LEN         (1U)
#define SYS_CFG_RXWTOE_BIT_MASK        0x200U
#define SYS_CFG_CIA_STS_BIT_OFFSET     (8U)
#define SYS_CFG_CIA_STS_BIT_LEN        (1U)
#define SYS_CFG_CIA_STS_BIT_MASK       0x100U
#define SYS_CFG_CIA_IPATOV_BIT_OFFSET  (7U)
#define SYS_CFG_CIA_IPATOV_BIT_LEN     (1U)
#define SYS_CFG_CIA_IPATOV_BIT_MASK    0x80U
#define SYS_CFG_SPI_CRC_BIT_OFFSET     (6U)
#define SYS_CFG_SPI_CRC_BIT_LEN        (1U)
#define SYS_CFG_SPI_CRC_BIT_MASK       0x40U
#define SYS_CFG_PHR_6M8_BIT_OFFSET     (5UL)
#define SYS_CFG_PHR_6M8_BIT_LEN        (1U)
#define SYS_CFG_PHR_6M8_BIT_MASK       0x20UL
#define SYS_CFG_PHR_MODE_BIT_OFFSET    (4U)
#define SYS_CFG_PHR_MODE_BIT_LEN       (1U)
#define SYS_CFG_PHR_MODE_BIT_MASK      0x10UL
#define SYS_CFG_DIS_DRXB_BIT_OFFSET    (3U)
#define SYS_CFG_DIS_DRXB_BIT_LEN       (1U)
#define SYS_CFG_DIS_DRXB_BIT_MASK      0x8UL
#define SYS_CFG_DIS_FCE_BIT_OFFSET     (2U)
#define SYS_CFG_DIS_FCE_BIT_LEN        (1U)
#define SYS_CFG_DIS_FCE_BIT_MASK       0x4UL
#define SYS_CFG_DIS_FCS_TX_BIT_OFFSET  (1U)
#define SYS_CFG_DIS_FCS_TX_BIT_LEN     (1U)
#define SYS_CFG_DIS_FCS_TX_BIT_MASK    0x2UL
#define SYS_CFG_FFEN_BIT_OFFSET        (0U)
#define SYS_CFG_FFEN_BIT_LEN           (1U)
#define SYS_CFG_FFEN_BIT_MASK          0x1U

/******************************************************************************
 * @brief Bit definitions for register ADR_FILT_CFG
 **/
#define ADR_FILT_CFG_ID                  0x14UL
#define ADR_FILT_CFG_LEN                 (4U)
#define ADR_FILT_CFG_MASK                0xFFFFFFFFUL
#define ADR_FILT_CFG_LSADRAPE_BIT_OFFSET (15U)
#define ADR_FILT_CFG_LSADRAPE_BIT_LEN    (1U)
#define ADR_FILT_CFG_LSADRAPE_BIT_MASK   0x8000U
#define ADR_FILT_CFG_SSADRAPE_BIT_OFFSET (14U)
#define ADR_FILT_CFG_SSADRAPE_BIT_LEN    (1U)
#define ADR_FILT_CFG_SSADRAPE_BIT_MASK   0x4000U
#define ADR_FILT_CFG_LE3_PEND_BIT_OFFSET (13U)
#define ADR_FILT_CFG_LE3_PEND_BIT_LEN    (1U)
#define ADR_FILT_CFG_LE3_PEND_BIT_MASK   0x2000U
#define ADR_FILT_CFG_LE2_PEND_BIT_OFFSET (12U)
#define ADR_FILT_CFG_LE2_PEND_BIT_LEN    (1U)
#define ADR_FILT_CFG_LE2_PEND_BIT_MASK   0x1000U
#define ADR_FILT_CFG_LE1_PEND_BIT_OFFSET (11U)
#define ADR_FILT_CFG_LE1_PEND_BIT_LEN    (1U)
#define ADR_FILT_CFG_LE1_PEND_BIT_MASK   0x800U
#define ADR_FILT_CFG_LE0_PEND_BIT_OFFSET (10U)
#define ADR_FILT_CFG_LE0_PEND_BIT_LEN    (1U)
#define ADR_FILT_CFG_LE0_PEND_BIT_MASK   0x400U
#define ADR_FILT_CFG_FFIB_BIT_OFFSET     (9U)
#define ADR_FILT_CFG_FFIB_BIT_LEN        (1U)
#define ADR_FILT_CFG_FFIB_BIT_MASK       0x200U
#define ADR_FILT_CFG_FFBC_BIT_OFFSET     (8U)
#define ADR_FILT_CFG_FFBC_BIT_LEN        (1U)
#define ADR_FILT_CFG_FFBC_BIT_MASK       0x100U
#define ADR_FILT_CFG_FFAE_BIT_OFFSET     (7U)
#define ADR_FILT_CFG_FFAE_BIT_LEN        (1U)
#define ADR_FILT_CFG_FFAE_BIT_MASK       0x80U
#define ADR_FILT_CFG_FFAF_BIT_OFFSET     (6U)
#define ADR_FILT_CFG_FFAF_BIT_LEN        (1U)
#define ADR_FILT_CFG_FFAF_BIT_MASK       0x40U
#define ADR_FILT_CFG_FFAMULTI_BIT_OFFSET (5U)
#define ADR_FILT_CFG_FFAMULTI_BIT_LEN    (1U)
#define ADR_FILT_CFG_FFAMULTI_BIT_MASK   0x20U
#define ADR_FILT_CFG_FFAR_BIT_OFFSET     (4U)
#define ADR_FILT_CFG_FFAR_BIT_LEN        (1U)
#define ADR_FILT_CFG_FFAR_BIT_MASK       0x10U
#define ADR_FILT_CFG_FFAM_BIT_OFFSET     (3U)
#define ADR_FILT_CFG_FFAM_BIT_LEN        (1U)
#define ADR_FILT_CFG_FFAM_BIT_MASK       0x8U
#define ADR_FILT_CFG_FFAA_BIT_OFFSET     (2U)
#define ADR_FILT_CFG_FFAA_BIT_LEN        (1U)
#define ADR_FILT_CFG_FFAA_BIT_MASK       0x4U
#define ADR_FILT_CFG_FFAD_BIT_OFFSET     (1U)
#define ADR_FILT_CFG_FFAD_BIT_LEN        (1U)
#define ADR_FILT_CFG_FFAD_BIT_MASK       0x2U
#define ADR_FILT_CFG_FFAB_BIT_OFFSET     (0U)
#define ADR_FILT_CFG_FFAB_BIT_LEN        (1U)
#define ADR_FILT_CFG_FFAB_BIT_MASK       0x1U

