HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register LE_PEND_01
 **/
#define LE_PEND_01_ID   0x10018UL
#define LE_PEND_01_LEN  (4U)
#define LE_PEND_01_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register LE_PEND_23
 **/
#define LE_PEND_23_ID   0x1001CUL
#define LE_PEND_23_LEN  (4U)
#define LE_PEND_23_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register RDB_STATUS
 **/
#define RDB_STATUS_ID                  0x10024UL
#define RDB_STATUS_LEN                 (4U)
#define RDB_STATUS_MASK                0xFFFFFFFFUL
#define RDB_STATUS_CP_ERR1_BIT_OFFSET  (7U)
#define RDB_STATUS_CP_ERR1_BIT_LEN     (1U)
#define RDB_STATUS_CP_ERR1_BIT_MASK    0x80U
#define RDB_STATUS_CIADONE1_BIT_OFFSET (6U)
#define RDB_STATUS_CIADONE1_BIT_LEN    (1U)
#define RDB_STATUS_CIADONE1_BIT_MASK   0x40U
#define RDB_STATUS_RXFR1_BIT_OFFSET    (5U)
#define RDB_STATUS_RXFR1_BIT_LEN       (1U)
#define RDB_STATUS_RXFR1_BIT_MASK      0x20U
#define RDB_STATUS_RXFCG1_BIT_OFFSET   (4U)
#define RDB_STATUS_RXFCG1_BIT_LEN      (1U)
#define RDB_STATUS_RXFCG1_BIT_MASK     0x10U
#define RDB_STATUS_CP_ERR0_BIT_OFFSET  (3U)
#define RDB_STATUS_CP_ERR0_BIT_LEN     (1U)
#define RDB_STATUS_CP_ERR0_BIT_MASK    0x8U
#define RDB_STATUS_CIADONE0_BIT_OFFSET (2U)
#define RDB_STATUS_CIADONE0_BIT_LEN    (1U)
#define RDB_STATUS_CIADONE0_BIT_MASK   0x4U
#define RDB_STATUS_RXFR0_BIT_OFFSET    (1U)
#define RDB_STATUS_RXFR0_BIT_LEN       (1U)
#define RDB_STATUS_RXFR0_BIT_MASK      0x2U
#define RDB_STATUS_RXFCG0_BIT_OFFSET   (0U)
#define RDB_STATUS_RXFCG0_BIT_LEN      (1U)
#define RDB_STATUS_RXFCG0_BIT_MASK     0x1U

/******************************************************************************
 * @brief Bit definitions for register RDB_DIAG_MODE
 **/
#define RDB_DIAG_MODE_ID                   0x10028UL
#define RDB_DIAG_MODE_LEN                  (4U)
#define RDB_DIAG_MODE_MASK                 0xFFFFFFFFUL
#define RDB_DIAG_MODE_RDB_DMODE_BIT_OFFSET (0U)
#define RDB_DIAG_MODE_RDB_DMODE_BIT_LEN    (3U)
#define RDB_DIAG_MODE_RDB_DMODE_BIT_MASK   0x7U

/******************************************************************************
 * @brief Bit definitions for register AES_CFG
 **/
#define AES_CFG_ID                  0x10030UL
#define AES_CFG_LEN                 (4U)
#define AES_CFG_MASK                0xFFFFFFFFUL
#define AES_CFG_KEY_OTP_BIT_OFFSET  (12U)
#define AES_CFG_KEY_OTP_BIT_LEN     (1U)
#define AES_CFG_KEY_OTP_BIT_MASK    0x1000U
#define AES_CFG_CORE_SEL_BIT_OFFSET (11U)
#define AES_CFG_CORE_SEL_BIT_LEN    (1U)
#define AES_CFG_CORE_SEL_BIT_MASK   0x800U
#define AES_CFG_TAG_SIZE_BIT_OFFSET (8U)
#define AES_CFG_TAG_SIZE_BIT_LEN    (3U)
#define AES_CFG_TAG_SIZE_BIT_MASK   0x700U
#define AES_CFG_KEY_SRC_BIT_OFFSET  (7U)
#define AES_CFG_KEY_SRC_BIT_LEN     (1U)
#define AES_CFG_KEY_SRC_BIT_MASK    0x80U
#define AES_CFG_KEY_LOAD_BIT_OFFSET (6U)
#define AES_CFG_KEY_LOAD_BIT_LEN    (1U)
#define AES_CFG_KEY_LOAD_BIT_MASK   0x40U
#define AES_CFG_KEY_ADDR_BIT_OFFSET (3U)
#define AES_CFG_KEY_ADDR_BIT_LEN    (3U)
#define AES_CFG_KEY_ADDR_BIT_MASK   0x38U
#define AES_CFG_KEY_SIZE_BIT_OFFSET (1U)
#define AES_CFG_KEY_SIZE_BIT_LEN    (2U)
#define AES_CFG_KEY_SIZE_BIT_MASK   0x6U
#define AES_CFG_MODE_BIT_OFFSET     (0U)
#define AES_CFG_MODE_BIT_LEN        (1U)
#define AES_CFG_MODE_BIT_MASK       0x1U

/******************************************************************************
 * @brief Bit definitions for register AES_IV0
 **/
#define AES_IV0_ID   0x10034UL
#define AES_IV0_LEN  (4U)
#define AES_IV0_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register AES_IV1
 **/
#define AES_IV1_ID   0x10038UL
#define AES_IV1_LEN  (4U)
#define AES_IV1_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register AES_IV2
 **/
#define AES_IV2_ID   0x1003CUL
#define AES_IV2_LEN  (4U)
#define AES_IV2_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register AES_IV3
 **/
#define AES_IV3_ID   0x10040UL
#define AES_IV3_LEN  (4U)
#define AES_IV3_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DMA_CFG0
 **/
#define DMA_CFG0_ID                    0x10044UL
#define DMA_CFG0_LEN                   (4U)
#define DMA_CFG0_MASK                  0xFFFFFFFFUL
#define DMA_CFG0_CP_END_SEL_BIT_OFFSET (26U)
#define DMA_CFG0_CP_END_SEL_BIT_LEN    (1U)
#define DMA_CFG0_CP_END_SEL_BIT_MASK   0x4000000UL
#define DMA_CFG0_DST_ADDR_BIT_OFFSET   (16U)
#define DMA_CFG0_DST_ADDR_BIT_LEN      (10U)
#define DMA_CFG0_DST_ADDR_BIT_MASK     0x3ff0000UL
#define DMA_CFG0_DST_PORT_BIT_OFFSET   (13U)
#define DMA_CFG0_DST_PORT_BIT_LEN      (3U)
#define DMA_CFG0_DST_PORT_BIT_MASK     0xe000U
#define DMA_CFG0_SRC_ADDR_BIT_OFFSET   (3U)
#define DMA_CFG0_SRC_ADDR_BIT_LEN      (10U)
#define DMA_CFG0_SRC_ADDR_BIT_MASK     0x1ff8U
#define DMA_CFG0_SRC_PORT_BIT_OFFSET   (0U)
#define DMA_CFG0_SRC_PORT_BIT_LEN      (3U)
#define DMA_CFG0_SRC_PORT_BIT_MASK     0x7U

/******************************************************************************
 * @brief Bit definitions for register DMA_CFG1
 **/
#define DMA_CFG1_ID                   0x10048UL
#define DMA_CFG1_LEN                  (4U)
#define DMA_CFG1_MASK                 0xFFFFFFFFUL
#define DMA_CFG1_PYLD_SIZE_BIT_OFFSET (7U)
#define DMA_CFG1_PYLD_SIZE_BIT_LEN    (10U)
#define DMA_CFG1_PYLD_SIZE_BIT_MASK   0x1ff80UL
#define DMA_CFG1_HDR_SIZE_BIT_OFFSET  (0U)
#define DMA_CFG1_HDR_SIZE_BIT_LEN     (7U)
#define DMA_CFG1_HDR_SIZE_BIT_MASK    0x7fU

