HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register AES_START
 **/
#define AES_START_ID                   0x1004CUL
#define AES_START_LEN                  (4U)
#define AES_START_MASK                 0xFFFFFFFFUL
#define AES_START_AES_START_BIT_OFFSET (0U)
#define AES_START_AES_START_BIT_LEN    (1U)
#define AES_START_AES_START_BIT_MASK   0x1U

/******************************************************************************
 * @brief Bit definitions for register AES_STS
 **/
#define AES_STS_ID                   0x10050UL
#define AES_STS_LEN                  (4U)
#define AES_STS_MASK                 0xFFFFFFFFUL
#define AES_STS_RAM_FULL_BIT_OFFSET  (5U)
#define AES_STS_RAM_FULL_BIT_LEN     (1U)
#define AES_STS_RAM_FULL_BIT_MASK    0x20U
#define AES_STS_RAM_EMPTY_BIT_OFFSET (4U)
#define AES_STS_RAM_EMPTY_BIT_LEN    (1U)
#define AES_STS_RAM_EMPTY_BIT_MASK   0x10U
#define AES_STS_MEM_CONF_BIT_OFFSET  (3U)
#define AES_STS_MEM_CONF_BIT_LEN     (1U)
#define AES_STS_MEM_CONF_BIT_MASK    0x8U
#define AES_STS_TRANS_ERR_BIT_OFFSET (2U)
#define AES_STS_TRANS_ERR_BIT_LEN    (1U)
#define AES_STS_TRANS_ERR_BIT_MASK   0x4U
#define AES_STS_AUTH_ERR_BIT_OFFSET  (1U)
#define AES_STS_AUTH_ERR_BIT_LEN     (1U)
#define AES_STS_AUTH_ERR_BIT_MASK    0x2U
#define AES_STS_AES_DONE_BIT_OFFSET  (0U)
#define AES_STS_AES_DONE_BIT_LEN     (1U)
#define AES_STS_AES_DONE_BIT_MASK    0x1U

/******************************************************************************
 * @brief Bit definitions for register AES_KEY0
 **/
#define AES_KEY0_ID   0x10054UL
#define AES_KEY0_LEN  (4U)
#define AES_KEY0_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register AES_KEY1
 **/
#define AES_KEY1_ID   0x10058UL
#define AES_KEY1_LEN  (4U)
#define AES_KEY1_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register AES_KEY2
 **/
#define AES_KEY2_ID   0x1005CUL
#define AES_KEY2_LEN  (4U)
#define AES_KEY2_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register AES_KEY3
 **/
#define AES_KEY3_ID   0x10060UL
#define AES_KEY3_LEN  (4U)
#define AES_KEY3_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_CFG0
 **/
#define STS_CFG0_ID                 0x20000UL
#define STS_CFG0_LEN                (4U)
#define STS_CFG0_MASK               0xFFFFFFFFUL
#define STS_CFG0_CPS_LEN_BIT_OFFSET (0U)
#define STS_CFG0_CPS_LEN_BIT_LEN    (8U)
#define STS_CFG0_CPS_LEN_BIT_MASK   0xffU

/******************************************************************************
 * @brief Bit definitions for register STS_CTRL
 **/
#define STS_CTRL_ID                  0x20004UL
#define STS_CTRL_LEN                 (4U)
#define STS_CTRL_MASK                0xFFFFFFFFUL
#define STS_CTRL_RST_LAST_BIT_OFFSET (1U)
#define STS_CTRL_RST_LAST_BIT_LEN    (1U)
#define STS_CTRL_RST_LAST_BIT_MASK   0x2U
#define STS_CTRL_LOAD_IV_BIT_OFFSET  (0U)
#define STS_CTRL_LOAD_IV_BIT_LEN     (1U)
#define STS_CTRL_LOAD_IV_BIT_MASK    0x1U

/******************************************************************************
 * @brief Bit definitions for register STS_STS
 **/
#define STS_STS_ID                  0x20008UL
#define STS_STS_LEN                 (4U)
#define STS_STS_MASK                0xFFFFFFFFUL
#define STS_STS_ACC_QUAL_BIT_OFFSET (0U)
#define STS_STS_ACC_QUAL_BIT_LEN    (12U)
#define STS_STS_ACC_QUAL_BIT_MASK   0xfffU

/******************************************************************************
 * @brief Bit definitions for register STS_KEY0
 **/
#define STS_KEY0_ID   0x2000CUL
#define STS_KEY0_LEN  (4U)
#define STS_KEY0_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_KEY1
 **/
#define STS_KEY1_ID   0x20010UL
#define STS_KEY1_LEN  (4U)
#define STS_KEY1_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_KEY2
 **/
#define STS_KEY2_ID   0x20014UL
#define STS_KEY2_LEN  (4U)
#define STS_KEY2_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_KEY3
 **/
#define STS_KEY3_ID   0x20018UL
#define STS_KEY3_LEN  (4U)
#define STS_KEY3_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_IV0
 **/
#define STS_IV0_ID   0x2001CUL
#define STS_IV0_LEN  (4U)
#define STS_IV0_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_IV1
 **/
#define STS_IV1_ID   0x20020UL
#define STS_IV1_LEN  (4U)
#define STS_IV1_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_IV2
 **/
#define STS_IV2_ID   0x20024UL
#define STS_IV2_LEN  (4U)
#define STS_IV2_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_IV3
 **/
#define STS_IV3_ID   0x20028UL
#define STS_IV3_LEN  (4U)
#define STS_IV3_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register LCSS_MARGIN
 **/
#define LCSS_MARGIN_ID   0x20034UL
#define LCSS_MARGIN_LEN  (4U)
#define LCSS_MARGIN_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register MRX_CFG
 **/
#define MRX_CFG_ID   0x30000UL
#define MRX_CFG_LEN  (4U)
#define MRX_CFG_MASK 0xFFFFFFFFUL

