HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register ADC_THRESH_CFG
 **/
#define ADC_THRESH_CFG_ID   0x30010UL
#define ADC_THRESH_CFG_LEN  (4U)
#define ADC_THRESH_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register AGC_CFG
 **/
#define AGC_CFG_ID   0x30014UL
#define AGC_CFG_LEN  (4U)
#define AGC_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_CFG
 **/
#define DGC_CFG_ID                    0x30018UL
#define DGC_CFG_LEN                   (4U)
#define DGC_CFG_MASK                  0xFFFFFFFFUL
#define DGC_CFG_THR_64_BIT_OFFSET     (9U)
#define DGC_CFG_THR_64_BIT_LEN        (6U)
#define DGC_CFG_THR_64_BIT_MASK       0x7e00U
#define DGC_CFG_RX_TUNE_EN_BIT_OFFSET (0U)
#define DGC_CFG_RX_TUNE_EN_BIT_LEN    (1U)
#define DGC_CFG_RX_TUNE_EN_BIT_MASK   0x1U

/******************************************************************************
 * @brief Bit definitions for register DGC_CFG0
 **/
#define DGC_CFG0_ID   0x3001CUL
#define DGC_CFG0_LEN  (4U)
#define DGC_CFG0_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_CFG1
 **/
#define DGC_CFG1_ID   0x30020UL
#define DGC_CFG1_LEN  (4U)
#define DGC_CFG1_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_CFG2
 **/
#define DGC_CFG2_ID   0x30024UL
#define DGC_CFG2_LEN  (4U)
#define DGC_CFG2_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_0_CFG
 **/
#define DGC_LUT_0_CFG_ID   0x30038UL
#define DGC_LUT_0_CFG_LEN  (4U)
#define DGC_LUT_0_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_1_CFG
 **/
#define DGC_LUT_1_CFG_ID   0x3003CUL
#define DGC_LUT_1_CFG_LEN  (4U)
#define DGC_LUT_1_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_2_CFG
 **/
#define DGC_LUT_2_CFG_ID   0x30040UL
#define DGC_LUT_2_CFG_LEN  (4U)
#define DGC_LUT_2_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_3_CFG
 **/
#define DGC_LUT_3_CFG_ID   0x30044UL
#define DGC_LUT_3_CFG_LEN  (4U)
#define DGC_LUT_3_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_4_CFG
 **/
#define DGC_LUT_4_CFG_ID   0x30048UL
#define DGC_LUT_4_CFG_LEN  (4U)
#define DGC_LUT_4_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_5_CFG
 **/
#define DGC_LUT_5_CFG_ID   0x3004CUL
#define DGC_LUT_5_CFG_LEN  (4U)
#define DGC_LUT_5_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_6_CFG
 **/
#define DGC_LUT_6_CFG_ID   0x30050UL
#define DGC_LUT_6_CFG_LEN  (4U)
#define DGC_LUT_6_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register ADC_THRESH_DBG
 **/
#define ADC_THRESH_DBG_ID   0x30058UL
#define ADC_THRESH_DBG_LEN  (4U)
#define ADC_THRESH_DBG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_DBG
 **/
#define DGC_DBG_ID                      0x30060UL
#define DGC_DBG_LEN                     (4U)
#define DGC_DBG_MASK                    0xFFFFFFFFUL
#define DGC_DBG_DGC_DECISION_BIT_OFFSET (28U)
#define DGC_DBG_DGC_DECISION_BIT_LEN    (3U)
#define DGC_DBG_DGC_DECISION_BIT_MASK   0x70000000UL

/******************************************************************************
 * @brief Bit definitions for register EC_CTRL
 **/
#define EC_CTRL_ID                   0x40000UL
#define EC_CTRL_LEN                  (4U)
#define EC_CTRL_MASK                 0xFFFFFFFFUL
#define EC_CTRL_OSTR_MODE_BIT_OFFSET (11U)
#define EC_CTRL_OSTR_MODE_BIT_LEN    (1U)
#define EC_CTRL_OSTR_MODE_BIT_MASK   0x800U
#define EC_CTRL_OSTS_WAIT_BIT_OFFSET (3U)
#define EC_CTRL_OSTS_WAIT_BIT_LEN    (8U)
#define EC_CTRL_OSTS_WAIT_BIT_MASK   0x7f8U

/******************************************************************************
 * @brief Bit definitions for register RX_CAL_CFG
 **/
#define RX_CAL_CFG_ID                  0x4000CUL
#define RX_CAL_CFG_LEN                 (4U)
#define RX_CAL_CFG_MASK                0xFFFFFFFFUL
#define RX_CAL_CFG_COMP_DLY_BIT_OFFSET (16UL)
#define RX_CAL_CFG_COMP_DLY_BIT_LEN    (4U)
#define RX_CAL_CFG_COMP_DLY_BIT_MASK   0xf0000UL
#define RX_CAL_CFG_CAL_EN_BIT_OFFSET   (4U)
#define RX_CAL_CFG_CAL_EN_BIT_LEN      (1U)
#define RX_CAL_CFG_CAL_EN_BIT_MASK     0x10U
#define RX_CAL_CFG_CAL_MODE_BIT_OFFSET (0U)
#define RX_CAL_CFG_CAL_MODE_BIT_LEN    (2U)
#define RX_CAL_CFG_CAL_MODE_BIT_MASK   0x3UL

/******************************************************************************
 * @brief Bit definitions for register RX_CAL_RESI
 **/
#define RX_CAL_RESI_ID   0x40014UL
#define RX_CAL_RESI_LEN  (4U)
#define RX_CAL_RESI_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register RX_CAL_RESQ
 **/
#define RX_CAL_RESQ_ID   0x4001CUL
#define RX_CAL_RESQ_LEN  (4U)
#define RX_CAL_RESQ_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register RX_CAL_STS
 **/
#define RX_CAL_STS_ID   0x40020UL
#define RX_CAL_STS_LEN  (1U)
#define RX_CAL_STS_MASK 0xFFUL

