HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register GPIO_ISEN
 **/
#define GPIO_ISEN_ID                0x50018UL
#define GPIO_ISEN_LEN               (4U)
#define GPIO_ISEN_MASK              0xFFFFFFFFUL
#define GPIO_ISEN_GISEN8_BIT_OFFSET (8U)
#define GPIO_ISEN_GISEN8_BIT_LEN    (1U)
#define GPIO_ISEN_GISEN8_BIT_MASK   0x100U
#define GPIO_ISEN_GISEN7_BIT_OFFSET (7U)
#define GPIO_ISEN_GISEN7_BIT_LEN    (1U)
#define GPIO_ISEN_GISEN7_BIT_MASK   0x80U
#define GPIO_ISEN_GISEN6_BIT_OFFSET (6U)
#define GPIO_ISEN_GISEN6_BIT_LEN    (1U)
#define GPIO_ISEN_GISEN6_BIT_MASK   0x40U
#define GPIO_ISEN_GISEN5_BIT_OFFSET (5U)
#define GPIO_ISEN_GISEN5_BIT_LEN    (1U)
#define GPIO_ISEN_GISEN5_BIT_MASK   0x20U
#define GPIO_ISEN_GISEN4_BIT_OFFSET (4U)
#define GPIO_ISEN_GISEN4_BIT_LEN    (1U)
#define GPIO_ISEN_GISEN4_BIT_MASK   0x10U
#define GPIO_ISEN_GISEN3_BIT_OFFSET (3U)
#define GPIO_ISEN_GISEN3_BIT_LEN    (1U)
#define GPIO_ISEN_GISEN3_BIT_MASK   0x8U
#define GPIO_ISEN_GISEN2_BIT_OFFSET (2U)
#define GPIO_ISEN_GISEN2_BIT_LEN    (1U)
#define GPIO_ISEN_GISEN2_BIT_MASK   0x4U
#define GPIO_ISEN_GISEN1_BIT_OFFSET (1U)
#define GPIO_ISEN_GISEN1_BIT_LEN    (1U)
#define GPIO_ISEN_GISEN1_BIT_MASK   0x2U
#define GPIO_ISEN_GISEN0_BIT_OFFSET (0U)
#define GPIO_ISEN_GISEN0_BIT_LEN    (1U)
#define GPIO_ISEN_GISEN0_BIT_MASK   0x1U

/******************************************************************************
 * @brief Bit definitions for register GPIO_IMODE
 **/
#define GPIO_IMODE_ID                0x5001CUL
#define GPIO_IMODE_LEN               (4U)
#define GPIO_IMODE_MASK              0xFFFFFFFFUL
#define GPIO_IMODE_GIMOD8_BIT_OFFSET (8U)
#define GPIO_IMODE_GIMOD8_BIT_LEN    (1U)
#define GPIO_IMODE_GIMOD8_BIT_MASK   0x100U
#define GPIO_IMODE_GIMOD7_BIT_OFFSET (7U)
#define GPIO_IMODE_GIMOD7_BIT_LEN    (1U)
#define GPIO_IMODE_GIMOD7_BIT_MASK   0x80U
#define GPIO_IMODE_GIMOD6_BIT_OFFSET (6U)
#define GPIO_IMODE_GIMOD6_BIT_LEN    (1U)
#define GPIO_IMODE_GIMOD6_BIT_MASK   0x40U
#define GPIO_IMODE_GIMOD5_BIT_OFFSET (5U)
#define GPIO_IMODE_GIMOD5_BIT_LEN    (1U)
#define GPIO_IMODE_GIMOD5_BIT_MASK   0x20U
#define GPIO_IMODE_GIMOD4_BIT_OFFSET (4U)
#define GPIO_IMODE_GIMOD4_BIT_LEN    (1U)
#define GPIO_IMODE_GIMOD4_BIT_MASK   0x10U
#define GPIO_IMODE_GIMOD3_BIT_OFFSET (3U)
#define GPIO_IMODE_GIMOD3_BIT_LEN    (1U)
#define GPIO_IMODE_GIMOD3_BIT_MASK   0x8U
#define GPIO_IMODE_GIMOD2_BIT_OFFSET (2U)
#define GPIO_IMODE_GIMOD2_BIT_LEN    (1U)
#define GPIO_IMODE_GIMOD2_BIT_MASK   0x4U
#define GPIO_IMODE_GIMOD1_BIT_OFFSET (1U)
#define GPIO_IMODE_GIMOD1_BIT_LEN    (1U)
#define GPIO_IMODE_GIMOD1_BIT_MASK   0x2U
#define GPIO_IMODE_GIMOD0_BIT_OFFSET (0U)
#define GPIO_IMODE_GIMOD0_BIT_LEN    (1U)
#define GPIO_IMODE_GIMOD0_BIT_MASK   0x1U

/******************************************************************************
 * @brief Bit definitions for register GPIO_IBES
 **/
#define GPIO_IBES_ID                0x50020UL
#define GPIO_IBES_LEN               (4U)
#define GPIO_IBES_MASK              0xFFFFFFFFUL
#define GPIO_IBES_GIBES8_BIT_OFFSET (8U)
#define GPIO_IBES_GIBES8_BIT_LEN    (1U)
#define GPIO_IBES_GIBES8_BIT_MASK   0x100U
#define GPIO_IBES_GIBES7_BIT_OFFSET (7U)
#define GPIO_IBES_GIBES7_BIT_LEN    (1U)
#define GPIO_IBES_GIBES7_BIT_MASK   0x80U
#define GPIO_IBES_GIBES6_BIT_OFFSET (6U)
#define GPIO_IBES_GIBES6_BIT_LEN    (1U)
#define GPIO_IBES_GIBES6_BIT_MASK   0x40U
#define GPIO_IBES_GIBES5_BIT_OFFSET (5U)
#define GPIO_IBES_GIBES5_BIT_LEN    (1U)
#define GPIO_IBES_GIBES5_BIT_MASK   0x20U
#define GPIO_IBES_GIBES4_BIT_OFFSET (4U)
#define GPIO_IBES_GIBES4_BIT_LEN    (1U)
#define GPIO_IBES_GIBES4_BIT_MASK   0x10U
#define GPIO_IBES_GIBES3_BIT_OFFSET (3U)
#define GPIO_IBES_GIBES3_BIT_LEN    (1U)
#define GPIO_IBES_GIBES3_BIT_MASK   0x8U
#define GPIO_IBES_GIBES2_BIT_OFFSET (2U)
#define GPIO_IBES_GIBES2_BIT_LEN    (1U)
#define GPIO_IBES_GIBES2_BIT_MASK   0x4U
#define GPIO_IBES_GIBES1_BIT_OFFSET (1U)
#define GPIO_IBES_GIBES1_BIT_LEN    (1U)
#define GPIO_IBES_GIBES1_BIT_MASK   0x2U
#define GPIO_IBES_GIBES0_BIT_OFFSET (0U)
#define GPIO_IBES_GIBES0_BIT_LEN    (1U)
#define GPIO_IBES_GIBES0_BIT_MASK   0x1U

/******************************************************************************
 * @brief Bit definitions for register GPIO_ICLR
 **/
#define GPIO_ICLR_ID                0x50024UL
#define GPIO_ICLR_LEN               (4U)
#define GPIO_ICLR_MASK              0xFFFFFFFFUL
#define GPIO_ICLR_GICLR8_BIT_OFFSET (8U)
#define GPIO_ICLR_GICLR8_BIT_LEN    (1U)
#define GPIO_ICLR_GICLR8_BIT_MASK   0x100U
#define GPIO_ICLR_GICLR7_BIT_OFFSET (7U)
#define GPIO_ICLR_GICLR7_BIT_LEN    (1U)
#define GPIO_ICLR_GICLR7_BIT_MASK   0x80U
#define GPIO_ICLR_GICLR6_BIT_OFFSET (6U)
#define GPIO_ICLR_GICLR6_BIT_LEN    (1U)
#define GPIO_ICLR_GICLR6_BIT_MASK   0x40U
#define GPIO_ICLR_GICLR5_BIT_OFFSET (5U)
#define GPIO_ICLR_GICLR5_BIT_LEN    (1U)
#define GPIO_ICLR_GICLR5_BIT_MASK   0x20U
#define GPIO_ICLR_GICLR4_BIT_OFFSET (4U)
#define GPIO_ICLR_GICLR4_BIT_LEN    (1U)
#define GPIO_ICLR_GICLR4_BIT_MASK   0x10U
#define GPIO_ICLR_GICLR3_BIT_OFFSET (3U)
#define GPIO_ICLR_GICLR3_BIT_LEN    (1U)
#define GPIO_ICLR_GICLR3_BIT_MASK   0x8U
#define GPIO_ICLR_GICLR2_BIT_OFFSET (2U)
#define GPIO_ICLR_GICLR2_BIT_LEN    (1U)
#define GPIO_ICLR_GICLR2_BIT_MASK   0x4U
#define GPIO_ICLR_GICLR1_BIT_OFFSET (1U)
#define GPIO_ICLR_GICLR1_BIT_LEN    (1U)
#define GPIO_ICLR_GICLR1_BIT_MASK   0x2U
#define GPIO_ICLR_GICLR0_BIT_OFFSET (0U)
#define GPIO_ICLR_GICLR0_BIT_LEN    (1U)
#define GPIO_ICLR_GICLR0_BIT_MASK   0x1U

/******************************************************************************
 * @brief Bit definitions for register GPIO_IDBE
 **/
#define GPIO_IDBE_ID                0x50028UL
#define GPIO_IDBE_LEN               (4U)
#define GPIO_IDBE_MASK              0xFFFFFFFFUL
#define GPIO_IDBE_GIDBE8_BIT_OFFSET (8U)
#define GPIO_IDBE_GIDBE8_BIT_LEN    (1U)
#define GPIO_IDBE_GIDBE8_BIT_MASK   0x100U
#define GPIO_IDBE_GIDBE7_BIT_OFFSET (7U)
#define GPIO_IDBE_GIDBE7_BIT_LEN    (1U)
#define GPIO_IDBE_GIDBE7_BIT_MASK   0x80U
#define GPIO_IDBE_GIDBE6_BIT_OFFSET (6U)
#define GPIO_IDBE_GIDBE6_BIT_LEN    (1U)
#define GPIO_IDBE_GIDBE6_BIT_MASK   0x40U
#define GPIO_IDBE_GIDBE5_BIT_OFFSET (5U)
#define GPIO_IDBE_GIDBE5_BIT_LEN    (1U)
#define GPIO_IDBE_GIDBE5_BIT_MASK   0x20U
#define GPIO_IDBE_GIDBE4_BIT_OFFSET (4U)
#define GPIO_IDBE_GIDBE4_BIT_LEN    (1U)
#define GPIO_IDBE_GIDBE4_BIT_MASK   0x10U
#define GPIO_IDBE_GIDBE3_BIT_OFFSET (3U)
#define GPIO_IDBE_GIDBE3_BIT_LEN    (1U)
#define GPIO_IDBE_GIDBE3_BIT_MASK   0x8U
#define GPIO_IDBE_GIDBE2_BIT_OFFSET (2U)
#define GPIO_IDBE_GIDBE2_BIT_LEN    (1U)
#define GPIO_IDBE_GIDBE2_BIT_MASK   0x4U
#define GPIO_IDBE_GIDBE1_BIT_OFFSET (1U)
#define GPIO_IDBE_GIDBE1_BIT_LEN    (1U)
#define GPIO_IDBE_GIDBE1_BIT_MASK   0x2U
#define GPIO_IDBE_GIDBE0_BIT_OFFSET (0U)
#define GPIO_IDBE_GIDBE0_BIT_LEN    (1U)
#define GPIO_IDBE_GIDBE0_BIT_MASK   0x1U

