HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register GPIO_RAW
 **/
#define GPIO_RAW_ID                0x5002CUL
#define GPIO_RAW_LEN               (4U)
#define GPIO_RAW_MASK              0xFFFFFFFFUL
#define GPIO_RAW_GRAWP8_BIT_OFFSET (8U)
#define GPIO_RAW_GRAWP8_BIT_LEN    (1U)
#define GPIO_RAW_GRAWP8_BIT_MASK   0x100U
#define GPIO_RAW_GRAWP7_BIT_OFFSET (7U)
#define GPIO_RAW_GRAWP7_BIT_LEN    (1U)
#define GPIO_RAW_GRAWP7_BIT_MASK   0x80U
#define GPIO_RAW_GRAWP6_BIT_OFFSET (6U)
#define GPIO_RAW_GRAWP6_BIT_LEN    (1U)
#define GPIO_RAW_GRAWP6_BIT_MASK   0x40U
#define GPIO_RAW_GRAWP5_BIT_OFFSET (5U)
#define GPIO_RAW_GRAWP5_BIT_LEN    (1U)
#define GPIO_RAW_GRAWP5_BIT_MASK   0x20U
#define GPIO_RAW_GRAWP4_BIT_OFFSET (4U)
#define GPIO_RAW_GRAWP4_BIT_LEN    (1U)
#define GPIO_RAW_GRAWP4_BIT_MASK   0x10U
#define GPIO_RAW_GRAWP3_BIT_OFFSET (3U)
#define GPIO_RAW_GRAWP3_BIT_LEN    (1U)
#define GPIO_RAW_GRAWP3_BIT_MASK   0x8U
#define GPIO_RAW_GRAWP2_BIT_OFFSET (2U)
#define GPIO_RAW_GRAWP2_BIT_LEN    (1U)
#define GPIO_RAW_GRAWP2_BIT_MASK   0x4U
#define GPIO_RAW_GRAWP1_BIT_OFFSET (1U)
#define GPIO_RAW_GRAWP1_BIT_LEN    (1U)
#define GPIO_RAW_GRAWP1_BIT_MASK   0x2U
#define GPIO_RAW_GRAWP0_BIT_OFFSET (0U)
#define GPIO_RAW_GRAWP0_BIT_LEN    (1U)
#define GPIO_RAW_GRAWP0_BIT_MASK   0x1U

/******************************************************************************
 * @brief Bit definitions for register DTUNE0
 **/
#define DTUNE0_ID                     0x60000UL
#define DTUNE0_LEN                    (4U)
#define DTUNE0_MASK                   0xFFFFFFFFUL
#define DTUNE0_RX_SFD_TOC_BIT_OFFSET  (16U)
#define DTUNE0_RX_SFD_TOC_BIT_LEN     (16U)
#define DTUNE0_RX_SFD_TOC_BIT_MASK    0xffff0000UL
#define DTUNE0_DT0B4_BIT_OFFSET       (4U)
#define DTUNE0_DT0B4_BIT_LEN          (1U)
#define DTUNE0_DT0B4_BIT_MASK         0x10U
#define DTUNE0_PRE_PAC_SYM_BIT_OFFSET (0U)
#define DTUNE0_PRE_PAC_SYM_BIT_LEN    (2U)
#define DTUNE0_PRE_PAC_SYM_BIT_MASK   0x3U

/******************************************************************************
 * @brief Bit definitions for register SFD detection timout count (RX_SFD_TOC)
 **/
#define RX_SFD_TOC_ID                 0x60002UL
#define RX_SFD_TOC_LEN                (2U)
#define RX_SFD_TOC_MASK               0xFFFFUL
#define RX_SFD_TOC_PRE_TOC_BIT_OFFSET (0U)
#define RX_SFD_TOC_PRE_TOC_BIT_LEN    (16U)
#define RX_SFD_TOC_PRE_TOC_BIT_MASK   0xffffU

/******************************************************************************
 * @brief Bit definitions for register DTUNE1
 **/
#define DTUNE1_ID                 0x60004UL
#define DTUNE1_LEN                (4U)
#define DTUNE1_MASK               0xFFFFFFFFUL
#define DTUNE1_PRE_TOC_BIT_OFFSET (0U)
#define DTUNE1_PRE_TOC_BIT_LEN    (16U)
#define DTUNE1_PRE_TOC_BIT_MASK   0xffffU

/******************************************************************************
 * @brief Bit definitions for register DTUNE3
 **/
#define DTUNE3_ID   0x6000CUL
#define DTUNE3_LEN  (4U)
#define DTUNE3_MASK 0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register DTUNE4
**/
#define DTUNE4_ID                            0x60010UL
#define DTUNE4_LEN                           (4U)
#define DTUNE4_MASK                          0xFFFFFFFFUL
#define DTUNE4_RX_SFD_HLDOFF_BIT_OFFSET      (24U)
#define DTUNE4_RX_SFD_HLDOFF_BIT_LEN         (8U)
#define DTUNE4_RX_SFD_HLDOFF_BIT_MASK        0xff000000UL

/******************************************************************************
 * @brief Bit definitions for register DTUNE5
 **/
#define DTUNE5_ID   0x60014UL
#define DTUNE5_LEN  (4U)
#define DTUNE5_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DRX_DIAG3
 **/
#define DRX_DIAG3_ID                 0x60029UL
#define DRX_DIAG3_LEN                (4U)
#define DRX_DIAG3_MASK               0xFFFFFFFFUL
#define DRX_DIAG3_CAR_INT_BIT_OFFSET (0U)
#define DRX_DIAG3_CAR_INT_BIT_LEN    (21U)
#define DRX_DIAG3_CAR_INT_BIT_MASK   0x1fffffUL

/******************************************************************************
 * @brief Bit definitions for register RF_ENABLE
 **/
#define RF_ENABLE_ID                        0x70000UL
#define RF_ENABLE_LEN                       (4U)
#define RF_ENABLE_MASK                      0xFFFFFFFFUL
#define RF_ENABLE_PLL_RX_PRE_EN_BIT_OFFSET  (27U)
#define RF_ENABLE_PLL_RX_PRE_EN_BIT_LEN     (1U)
#define RF_ENABLE_PLL_RX_PRE_EN_BIT_MASK    0x8000000UL
#define RF_ENABLE_PLL_TX_PRE_EN_BIT_OFFSET  (26U)
#define RF_ENABLE_PLL_TX_PRE_EN_BIT_LEN     (1U)
#define RF_ENABLE_PLL_TX_PRE_EN_BIT_MASK    0x4000000UL
#define RF_ENABLE_TX_SW_EN_BIT_OFFSET       (25U)
#define RF_ENABLE_TX_SW_EN_BIT_LEN          (1U)
#define RF_ENABLE_TX_SW_EN_BIT_MASK         0x2000000UL
#define RF_ENABLE_TX_CH5_BIT_OFFSET         (13U)
#define RF_ENABLE_TX_CH5_BIT_LEN            (1U)
#define RF_ENABLE_TX_CH5_BIT_MASK           0x2000U
#define RF_ENABLE_TX_EN_BIT_OFFSET          (12U)
#define RF_ENABLE_TX_EN_BIT_LEN             (1U)
#define RF_ENABLE_TX_EN_BIT_MASK            0x1000U
#define RF_ENABLE_TX_EN_BUF_BIT_OFFSET      (11U)
#define RF_ENABLE_TX_EN_BUF_BIT_LEN         (1U)
#define RF_ENABLE_TX_EN_BUF_BIT_MASK        0x800U
#define RF_ENABLE_TX_BIAS_EN_BIT_OFFSET     (10U)
#define RF_ENABLE_TX_BIAS_EN_BIT_LEN        (1U)
#define RF_ENABLE_TX_BIAS_EN_BIT_MASK       0x400U

/******************************************************************************
 * @brief Bit definitions for register RF_CTRL_MASK
 **/
#define RF_CTRL_MASK_ID   0x70004UL
#define RF_CTRL_MASK_LEN  (4U)
#define RF_CTRL_MASK_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register RX_CTRL_HI
 **/
#define RX_CTRL_HI_ID   0x70010UL
#define RX_CTRL_HI_LEN  (4U)
#define RX_CTRL_HI_MASK 0xFFFFFFFFUL

