HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register RF_SWITCH_CTRL
 **/
#define RF_SWITCH_CTRL_ID                    0x70014UL
#define RF_SWITCH_CTRL_LEN                   (4U)
#define RF_SWITCH_CTRL_MASK                  0xFFFFFFFFUL
#define RF_SWITCH_CTRL_TXRX_SW_CTRL_BIT_OFFSET (24U)
#define RF_SWITCH_CTRL_TXRX_SW_CTRL_BIT_LEN (6U)
#define RF_SWITCH_CTRL_TXRX_SW_CTRL_BIT_MASK 0x3F000000UL
#define RF_SWITCH_CTRL_TXRX_SW_EN_BIT_OFFSET (16U)
#define RF_SWITCH_CTRL_TXRX_SW_EN_BIT_LEN (1U)
#define RF_SWITCH_CTRL_TXRX_SW_EN_BIT_MASK 0x10000UL
#define RF_SWITCH_CTRL_ANTSWCTRL_BIT_OFFSET  (12U)
#define RF_SWITCH_CTRL_ANTSWCTRL_BIT_LEN     (3U)
#define RF_SWITCH_CTRL_ANTSWCTRL_BIT_MASK    0x7000U
#define RF_SWITCH_CTRL_ANTSWEN_BIT_OFFSET    (8U)
#define RF_SWITCH_CTRL_ANTSWEN_BIT_LEN       (1U)
#define RF_SWITCH_CTRL_ANTSWEN_BIT_MASK      0x100U
#define RF_SWITCH_CTRL_ANT_SW_PDOA_PORT_BIT_OFFSET (1U)
#define RF_SWITCH_CTRL_ANT_SW_PDOA_PORT_BIT_LEN (1U)
#define RF_SWITCH_CTRL_ANT_SW_PDOA_PORT_BIT_MASK 0x2U
#define RF_SWITCH_CTRL_ANT_SW_NO_TOGGLE_BIT_OFFSET (0U)
#define RF_SWITCH_CTRL_ANT_SW_NO_TOGGLE_BIT_LEN (1U)
#define RF_SWITCH_CTRL_ANT_SW_NO_TOGGLE_BIT_MASK 0x1U


/******************************************************************************
 * @brief Bit definitions for register TX_CTRL_LO
 **/
#define TX_CTRL_LO_ID   0x70018UL
#define TX_CTRL_LO_LEN  (4U)
#define TX_CTRL_LO_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register RF_TX_CTRL_1
 **/
#define RF_TX_CTRL_1_ID   0x7001AUL
#define RF_TX_CTRL_1_LEN  (1U)
#define RF_TX_CTRL_1_MASK 0xFFUL

/******************************************************************************
 * @brief Bit definitions for register TX_CTRL_HI
 **/
#define TX_CTRL_HI_ID                     0x7001CUL
#define TX_CTRL_HI_LEN                    (4U)
#define TX_CTRL_HI_MASK                   0xFFFFFFFFUL
#define TX_CTRL_HI_TX_PG_DELAY_BIT_OFFSET (0U)
#define TX_CTRL_HI_TX_PG_DELAY_BIT_LEN    (6U)
#define TX_CTRL_HI_TX_PG_DELAY_BIT_MASK   0x3fU

/******************************************************************************
 * @brief Bit definitions for register TX_TEST
 **/
#define TX_TEST_ID                       0x70028UL
#define TX_TEST_LEN                      (4U)
#define TX_TEST_MASK                     0xFFFFFFFFUL
#define TX_TEST_TX_ENTEST_CH1_BIT_OFFSET (3U)
#define TX_TEST_TX_ENTEST_CH1_BIT_LEN    (1U)
#define TX_TEST_TX_ENTEST_CH1_BIT_MASK   0x8U
#define TX_TEST_TX_ENTEST_CH2_BIT_OFFSET (2U)
#define TX_TEST_TX_ENTEST_CH2_BIT_LEN    (1U)
#define TX_TEST_TX_ENTEST_CH2_BIT_MASK   0x4U
#define TX_TEST_TX_ENTEST_CH3_BIT_OFFSET (1U)
#define TX_TEST_TX_ENTEST_CH3_BIT_LEN    (1U)
#define TX_TEST_TX_ENTEST_CH3_BIT_MASK   0x2U
#define TX_TEST_TX_ENTEST_CH4_BIT_OFFSET (0U)
#define TX_TEST_TX_ENTEST_CH4_BIT_LEN    (1U)
#define TX_TEST_TX_ENTEST_CH4_BIT_MASK   0x1U

/******************************************************************************
* @brief Bit definitions for register SAR_TEST
**/
#define SAR_TEST_ID                                 0x70034UL
#define SAR_TEST_LEN                                (4U)
#define SAR_TEST_MASK                               0xFFFFFFFFUL
#define SAR_TEST_DIG_AUXADC_ATTN_EN_ULV_BIT_OFFSET  (22U)
#define SAR_TEST_DIG_AUXADC_ATTN_EN_ULV_BIT_LEN     (1U)
#define SAR_TEST_DIG_AUXADC_ATTN_EN_ULV_BIT_MASK    0x400000UL
#define SAR_TEST_DIG_AUXADC_ATTN_SEL_ULV_BIT_OFFSET (21UL)
#define SAR_TEST_DIG_AUXADC_ATTN_SEL_ULV_BIT_LEN    (1U)
#define SAR_TEST_DIG_AUXADC_ATTN_SEL_ULV_BIT_MASK   0x200000UL
#define SAR_TEST_SAR_RDEN_BIT_OFFSET                (2U)
#define SAR_TEST_SAR_RDEN_BIT_LEN                   (1U)
#define SAR_TEST_SAR_RDEN_BIT_MASK                  0x4UL

/******************************************************************************
* @brief Bit definitions for register PG_TST_DATA
**/
#define PG_TST_DATA_ID                       0x70038UL
#define PG_TST_DATA_LEN                      (4U)
#define PG_TST_DATA_MASK                     0xFFFFFFFFUL
#define PG_TST_DATA_PG_TEST_DATA_BIT_OFFSET  (0U)
#define PG_TST_DATA_PG_TEST_DATA_BIT_LEN     (32U)
#define PG_TST_DATA_PG_TEST_DATA_BIT_MASK    0xffffffffUL

/******************************************************************************
* @brief Bit definitions for register RF_STATUS
**/
#define RF_STATUS_ID                         0x7003CUL
#define RF_STATUS_LEN                        (4U)
#define RF_STATUS_MASK                       0xFFFFFFFFUL
#define RF_STATUS_PLL1_MID_FLAG_BIT_OFFSET   (3U)
#define RF_STATUS_PLL1_MID_FLAG_BIT_LEN      (1U)
#define RF_STATUS_PLL1_MID_FLAG_BIT_MASK     0x8U
#define RF_STATUS_PLL1_HI_FLAG_BIT_OFFSET    (2U)
#define RF_STATUS_PLL1_HI_FLAG_BIT_LEN       (1U)
#define RF_STATUS_PLL1_HI_FLAG_BIT_MASK      0x4U
#define RF_STATUS_PLL1_LO_FLAG_BIT_OFFSET    (1U)
#define RF_STATUS_PLL1_LO_FLAG_BIT_LEN       (1U)
#define RF_STATUS_PLL1_LO_FLAG_BIT_MASK      0x2U
#define RF_STATUS_PLL1_LOCK_BIT_OFFSET       (0U)
#define RF_STATUS_PLL1_LOCK_BIT_LEN          (1U)
#define RF_STATUS_PLL1_LOCK_BIT_MASK         0x1U

/******************************************************************************
 * @brief Bit definitions for register LDO_TUNE_LO
 **/
#define LDO_TUNE_LO_ID   0x70040UL
#define LDO_TUNE_LO_LEN  (4U)
#define LDO_TUNE_LO_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register LDO_TUNE_HI
 **/
#define LDO_TUNE_HI_ID                        0x70044UL
#define LDO_TUNE_HI_LEN                       (4U)
#define LDO_TUNE_HI_MASK                      0xFFFFFFFFUL
#define LDO_TUNE_HI_LDO_HVAUX_TUNE_BIT_OFFSET (12U)
#define LDO_TUNE_HI_LDO_HVAUX_TUNE_BIT_LEN    (4U)
#define LDO_TUNE_HI_LDO_HVAUX_TUNE_BIT_MASK   0xf000U

