HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register LDO_CTRL
 **/
#define LDO_CTRL_ID                          0x70048UL
#define LDO_CTRL_LEN                         (4U)
#define LDO_CTRL_MASK                        0xFFFFFFFFUL
#define LDO_CTRL_LDO_VDDHVTX_VREF_BIT_OFFSET (27U)
#define LDO_CTRL_LDO_VDDHVTX_VREF_BIT_LEN    (1U)
#define LDO_CTRL_LDO_VDDHVTX_VREF_BIT_MASK   0x8000000UL
#define LDO_CTRL_LDO_VDDTX2_VREF_BIT_OFFSET  (22U)
#define LDO_CTRL_LDO_VDDTX2_VREF_BIT_LEN     (1U)
#define LDO_CTRL_LDO_VDDTX2_VREF_BIT_MASK    0x400000UL
#define LDO_CTRL_LDO_VDDTX1_VREF_BIT_OFFSET  (21U)
#define LDO_CTRL_LDO_VDDTX1_VREF_BIT_LEN     (1U)
#define LDO_CTRL_LDO_VDDTX1_VREF_BIT_MASK    0x200000UL
#define LDO_CTRL_LDO_VDDPLL_VREF_BIT_OFFSET  (20U)
#define LDO_CTRL_LDO_VDDPLL_VREF_BIT_LEN     (1U)
#define LDO_CTRL_LDO_VDDPLL_VREF_BIT_MASK    0x100000UL
#define LDO_CTRL_LDO_VDDVCO_VREF_BIT_OFFSET  (19U)
#define LDO_CTRL_LDO_VDDVCO_VREF_BIT_LEN     (1U)
#define LDO_CTRL_LDO_VDDVCO_VREF_BIT_MASK    0x80000UL
#define LDO_CTRL_LDO_VDDMS2_VREF_BIT_OFFSET  (17U)
#define LDO_CTRL_LDO_VDDMS2_VREF_BIT_LEN     (1U)
#define LDO_CTRL_LDO_VDDMS2_VREF_BIT_MASK    0x20000UL
#define LDO_CTRL_LDO_VDDHVTX_EN_BIT_OFFSET   (11U)
#define LDO_CTRL_LDO_VDDHVTX_EN_BIT_LEN      (1U)
#define LDO_CTRL_LDO_VDDHVTX_EN_BIT_MASK     0x800U
#define LDO_CTRL_LDO_VDDIF2_EN_BIT_OFFSET    (8U)
#define LDO_CTRL_LDO_VDDIF2_EN_BIT_LEN       (1U)
#define LDO_CTRL_LDO_VDDIF2_EN_BIT_MASK      0x100U
#define LDO_CTRL_LDO_VDDTX2_EN_BIT_OFFSET    (6U)
#define LDO_CTRL_LDO_VDDTX2_EN_BIT_LEN       (1U)
#define LDO_CTRL_LDO_VDDTX2_EN_BIT_MASK      0x40U
#define LDO_CTRL_LDO_VDDTX1_EN_BIT_OFFSET    (5U)
#define LDO_CTRL_LDO_VDDTX1_EN_BIT_LEN       (1U)
#define LDO_CTRL_LDO_VDDTX1_EN_BIT_MASK      0x20U
#define LDO_CTRL_LDO_VDDPLL_EN_BIT_OFFSET    (4U)
#define LDO_CTRL_LDO_VDDPLL_EN_BIT_LEN       (1U)
#define LDO_CTRL_LDO_VDDPLL_EN_BIT_MASK      0x10U
#define LDO_CTRL_LDO_VDDMS3_EN_BIT_OFFSET    (2U)
#define LDO_CTRL_LDO_VDDMS3_EN_BIT_LEN       (1U)
#define LDO_CTRL_LDO_VDDVCO_EN_BIT_OFFSET    (3U)
#define LDO_CTRL_LDO_VDDVCO_EN_BIT_LEN       (1U)
#define LDO_CTRL_LDO_VDDVCO_EN_BIT_MASK      0x8UL
#define LDO_CTRL_LDO_VDDMS3_EN_BIT_MASK      0x4U
#define LDO_CTRL_LDO_VDDMS2_EN_BIT_OFFSET    (1U)
#define LDO_CTRL_LDO_VDDMS2_EN_BIT_LEN       (1U)
#define LDO_CTRL_LDO_VDDMS2_EN_BIT_MASK      0x2U
#define LDO_CTRL_LDO_VDDMS1_EN_BIT_OFFSET    (0U)
#define LDO_CTRL_LDO_VDDMS1_EN_BIT_LEN       (1U)
#define LDO_CTRL_LDO_VDDMS1_EN_BIT_MASK      0x1U

/******************************************************************************
 * @brief Bit definitions for register LDO_RLOAD
 **/
// FZ: in user manual, the ID is 07:51
// #define LDO_RLOAD_ID   0x70050UL
// #define LDO_RLOAD_LEN  (4U)
// #define LDO_RLOAD_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register LDO_RLOAD
 **/
#define LDO_RLOAD_ID   0x70051UL
#define LDO_RLOAD_LEN  (1U)
#define LDO_RLOAD_MASK 0xFFUL

/******************************************************************************
* @brief Bit definitions for register SAR_CTRL
**/
#define SAR_CTRL_ID                          0x80000UL
#define SAR_CTRL_LEN                         (4U)
#define SAR_CTRL_MASK                        0xFFFFFFFFUL
#define SAR_CTRL_SAR_FORCE_SEL_BIT_OFFSET    (12UL)
#define SAR_CTRL_SAR_FORCE_SEL_BIT_LEN       (3U)
#define SAR_CTRL_SAR_FORCE_SEL_BIT_MASK      0x7000U
#define SAR_CTRL_SAR_OVR_MUX_EN_BIT_OFFSET   (5U)
#define SAR_CTRL_SAR_OVR_MUX_EN_BIT_LEN      (1U)
#define SAR_CTRL_SAR_OVR_MUX_EN_BIT_MASK     0x20UL
#define SAR_CTRL_SAR_START_BIT_OFFSET        (0U)
#define SAR_CTRL_SAR_START_BIT_LEN           (1U)
#define SAR_CTRL_SAR_START_BIT_MASK          0x1UL

/******************************************************************************
 * @brief Bit definitions for register SAR_STATUS
 **/
#define SAR_STATUS_ID                  0x80004UL
#define SAR_STATUS_LEN                 (4U)
#define SAR_STATUS_MASK                0xFFFFFFFFUL
#define SAR_STATUS_SAR_DONE_BIT_OFFSET (0U)
#define SAR_STATUS_SAR_DONE_BIT_LEN    (1U)
#define SAR_STATUS_SAR_DONE_BIT_MASK   0x1UL

/******************************************************************************
 * @brief Bit definitions for register SAR_READING
 **/
#define SAR_READING_ID                          0x80008UL
#define SAR_READING_LEN                         (4U)
#define SAR_READING_MASK                        0xFFFFFFFFUL
#define SAR_READING_SAR_READING_TEMP_BIT_OFFSET (8U)
#define SAR_READING_SAR_READING_TEMP_BIT_LEN    (8U)
#define SAR_READING_SAR_READING_TEMP_BIT_MASK   0xff00U
#define SAR_READING_SAR_READING_VBAT_BIT_OFFSET (0U)
#define SAR_READING_SAR_READING_VBAT_BIT_LEN    (8U)
#define SAR_READING_SAR_READING_VBAT_BIT_MASK   0xffU

/******************************************************************************
 * @brief Bit definitions for register SAR_WAKE_RD
 **/
#define SAR_WAKE_RD_ID                       0x8000CUL
#define SAR_WAKE_RD_LEN                      (4U)
#define SAR_WAKE_RD_MASK                     0xFFFFFFFFUL
#define SAR_WAKE_RD_SAR_LAST_TEMP_BIT_OFFSET (8U)
#define SAR_WAKE_RD_SAR_LAST_TEMP_BIT_LEN    (8U)
#define SAR_WAKE_RD_SAR_LAST_TEMP_BIT_MASK   0xff00U
#define SAR_WAKE_RD_SAR_LAST_VBAT_BIT_OFFSET (0U)
#define SAR_WAKE_RD_SAR_LAST_VBAT_BIT_LEN    (8U)
#define SAR_WAKE_RD_SAR_LAST_VBAT_BIT_MASK   0xffU

/******************************************************************************
 * @brief Bit definitions for register PGC_CTRL
 **/
#define PGC_CTRL_ID                      0x80010UL
#define PGC_CTRL_LEN                     (4U)
#define PGC_CTRL_MASK                    0xFFFFFFFFUL
#define PGC_CTRL_PGC_AUTO_CAL_BIT_OFFSET (1U)
#define PGC_CTRL_PGC_AUTO_CAL_BIT_LEN    (1U)
#define PGC_CTRL_PGC_AUTO_CAL_BIT_MASK   0x2U
#define PGC_CTRL_PGC_START_BIT_OFFSET    (0U)
#define PGC_CTRL_PGC_START_BIT_LEN       (1U)
#define PGC_CTRL_PGC_START_BIT_MASK      0x1U

