HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register PGC_STATUS
 **/
#define PGC_STATUS_ID                        0x80014UL
#define PGC_STATUS_LEN                       (4U)
#define PGC_STATUS_MASK                      0xFFFFFFFFUL
#define PGC_STATUS_AUTOCAL_DONE_BIT_OFFSET   (12U)
#define PGC_STATUS_AUTOCAL_DONE_BIT_LEN      (1U)
#define PGC_STATUS_AUTOCAL_DONE_BIT_MASK     0x1000U
#define PGC_STATUS_PG_DELAY_COUNT_BIT_OFFSET (0U)
#define PGC_STATUS_PG_DELAY_COUNT_BIT_LEN    (12U)
#define PGC_STATUS_PG_DELAY_COUNT_BIT_MASK   0xfffU

/******************************************************************************
 * @brief Bit definitions for register PG_TEST
 **/
#define PG_TEST_ID                     0x80018UL
#define PG_TEST_LEN                    (4U)
#define PG_TEST_MASK                   0xFFFFFFFFUL
#define PG_TEST_TX_TEST_CH4_BIT_OFFSET (12U)
#define PG_TEST_TX_TEST_CH4_BIT_LEN    (4U)
#define PG_TEST_TX_TEST_CH4_BIT_MASK   0xf000U
#define PG_TEST_TX_TEST_CH3_BIT_OFFSET (8U)
#define PG_TEST_TX_TEST_CH3_BIT_LEN    (4U)
#define PG_TEST_TX_TEST_CH3_BIT_MASK   0xf00U
#define PG_TEST_TX_TEST_CH2_BIT_OFFSET (4U)
#define PG_TEST_TX_TEST_CH2_BIT_LEN    (4U)
#define PG_TEST_TX_TEST_CH2_BIT_MASK   0xf0U
#define PG_TEST_TX_TEST_CH1_BIT_OFFSET (0U)
#define PG_TEST_TX_TEST_CH1_BIT_LEN    (4U)
#define PG_TEST_TX_TEST_CH1_BIT_MASK   0xfU

/******************************************************************************
 * @brief Bit definitions for register PG_CAL_TARGET
 **/
#define PG_CAL_TARGET_ID                0x8001CUL
#define PG_CAL_TARGET_LEN               (4U)
#define PG_CAL_TARGET_MASK              0xFFFFFFFFUL
#define PG_CAL_TARGET_TARGET_BIT_OFFSET (0U)
#define PG_CAL_TARGET_TARGET_BIT_LEN    (12U)
#define PG_CAL_TARGET_TARGET_BIT_MASK   0xfffU

/******************************************************************************
 * @brief Bit definitions for register PLL_CFG
 **/
#define PLL_CFG_ID   0x90000UL
#define PLL_CFG_LEN  (4U)
#define PLL_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register PLL_COARSE_CODE
 **/
#define PLL_COARSE_CODE_ID                             0x90004UL
#define PLL_COARSE_CODE_LEN                            (4U)
#define PLL_COARSE_CODE_MASK                           0xFFFFFFFFUL
#define PLL_COARSE_CODE_CH9_RVCO_FREQ_BOOST_BIT_OFFSET (24U)
#define PLL_COARSE_CODE_CH9_RVCO_FREQ_BOOST_BIT_LEN    (1U)
#define PLL_COARSE_CODE_CH9_RVCO_FREQ_BOOST_BIT_MASK   0x1000000UL
#define PLL_COARSE_CODE_CH5_VCO_COARSE_TUNE_BIT_OFFSET (8U)
#define PLL_COARSE_CODE_CH5_VCO_COARSE_TUNE_BIT_LEN    (14U)
#define PLL_COARSE_CODE_CH5_VCO_COARSE_TUNE_BIT_MASK   0x3fff00UL
#define PLL_COARSE_CODE_CH9_VCO_COARSE_TUNE_BIT_OFFSET (0U)
#define PLL_COARSE_CODE_CH9_VCO_COARSE_TUNE_BIT_LEN    (5U)
#define PLL_COARSE_CODE_CH9_VCO_COARSE_TUNE_BIT_MASK   0x1fU

/******************************************************************************
 * @brief Bit definitions for register PLL_CAL
 **/
#define PLL_CAL_ID                           0x90008UL
#define PLL_CAL_LEN                          (4U)
#define PLL_CAL_MASK                         0xFFFFFFFFUL
#define PLL_CAL_PLL_WD_EN_BIT_OFFSET         (19U)
#define PLL_CAL_PLL_WD_EN_BIT_LEN            (1U)
#define PLL_CAL_PLL_WD_EN_BIT_MASK           0x80000UL
#define PLL_CAL_PLL_CAL_EN_BIT_OFFSET        (8U)
#define PLL_CAL_PLL_CAL_EN_BIT_LEN           (1U)
#define PLL_CAL_PLL_CAL_EN_BIT_MASK          0x100UL

#define PLL_CAL_PLL_PLL_CFG_LD_OFFSET        (4U)
#define PLL_CAL_PLL_PLL_CFG_LD_LEN           (4U)
#define PLL_CAL_PLL_PLL_CFG_LD_MASK          0xF0UL

#define PLL_CAL_PLL_TUNE_OVR_BIT_OFFSET      (2U)
#define PLL_CAL_PLL_TUNE_OVR_BIT_LEN         (1U)
#define PLL_CAL_PLL_TUNE_OVR_BIT_MASK        0x4UL
#define PLL_CAL_PLL_USE_OLD_BIT_OFFSET       (1U)
#define PLL_CAL_PLL_USE_OLD_BIT_LEN          (1U)
#define PLL_CAL_PLL_USE_OLD_BIT_MASK         0x2UL

/******************************************************************************
 * @brief Bit definitions for register PLL_COMMON
 **/
#define PLL_COMMON_ID   0x90010UL
#define PLL_COMMON_LEN  (2U)
#define PLL_COMMON_MASK 0x0000FFFFUL
#define PLL_COMMON_PLL_BIAS_TRIM_BIT_OFFSET (13UL)
#define PLL_COMMON_PLL_BIAS_TRIM_BIT_LEN (3U)
#define PLL_COMMON_PLL_BIAS_TRIM_MASK 0x0000E000UL

/******************************************************************************
* @brief Bit definitions for register PLL_STATUS
**/
#define PLL_STATUS_ID                        0x9000c
#define PLL_STATUS_LEN                       (4U)
#define PLL_STATUS_MASK                      0xFFFFFFFFUL
#define PLL_STATUS_LD_CODE_BIT_OFFSET        (8U)
#define PLL_STATUS_LD_CODE_BIT_LEN           (5U)
#define PLL_STATUS_LD_CODE_BIT_MASK          0x1f00U
#define PLL_STATUS_XTAL_AMP_SETTLED_BIT_OFFSET (6U)
#define PLL_STATUS_XTAL_AMP_SETTLED_BIT_LEN  (1U)
#define PLL_STATUS_XTAL_AMP_SETTLED_BIT_MASK 0x40U
#define PLL_STATUS_VCO_TUNE_UPDATE_BIT_OFFSET (5U)
#define PLL_STATUS_VCO_TUNE_UPDATE_BIT_LEN   (1U)
#define PLL_STATUS_VCO_TUNE_UPDATE_BIT_MASK  0x20U
#define PLL_STATUS_PLL_OVRFLOW_BIT_OFFSET    (4U)
#define PLL_STATUS_PLL_OVRFLOW_BIT_LEN       (1U)
#define PLL_STATUS_PLL_OVRFLOW_BIT_MASK      0x10U
#define PLL_STATUS_PLL_HI_FLAG_BIT_OFFSET    (3U)
#define PLL_STATUS_PLL_HI_FLAG_BIT_LEN       (1U)
#define PLL_STATUS_PLL_HI_FLAG_BIT_MASK      0x8U
#define PLL_STATUS_PLL_LO_FLAG_N_BIT_OFFSET  (2U)
#define PLL_STATUS_PLL_LO_FLAG_N_BIT_LEN     (1U)
#define PLL_STATUS_PLL_LO_FLAG_N_BIT_MASK    0x4U
#define PLL_STATUS_PLL_LOCK_FLAG_BIT_OFFSET  (1U)
#define PLL_STATUS_PLL_LOCK_FLAG_BIT_LEN     (1U)
#define PLL_STATUS_PLL_LOCK_FLAG_BIT_MASK    0x2U
#define PLL_STATUS_CPC_CAL_DONE_BIT_OFFSET   (0U)
#define PLL_STATUS_CPC_CAL_DONE_BIT_LEN      (1U)
#define PLL_STATUS_CPC_CAL_DONE_BIT_MASK     0x1U

