HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register XTAL
 **/
#define XTAL_ID                   0x90014UL
#define XTAL_LEN                  (4U)
#define XTAL_MASK                 0xFFFFFFFFUL
#define XTAL_XTAL_TRIM_BIT_OFFSET (0U)
#define XTAL_XTAL_TRIM_BIT_LEN    (7U)
#define XTAL_XTAL_TRIM_BIT_MASK   0x7fU

/******************************************************************************
 * @brief Bit definitions for register AON_DIG_CFG
 **/
#define AON_DIG_CFG_ID                        0xA0000UL
#define AON_DIG_CFG_LEN                       (4U)
#define AON_DIG_CFG_MASK                      0xFFFFFFFFUL
#define AON_DIG_CFG_ONWAKE_GO2RX_BIT_OFFSET   (9U)
#define AON_DIG_CFG_ONWAKE_GO2RX_BIT_LEN      (1U)
#define AON_DIG_CFG_ONWAKE_GO2RX_BIT_MASK     0x200U
#define AON_DIG_CFG_ONWAKE_GO2IDLE_BIT_OFFSET (8U)
#define AON_DIG_CFG_ONWAKE_GO2IDLE_BIT_LEN    (1U)
#define AON_DIG_CFG_ONWAKE_GO2IDLE_BIT_MASK   0x100U
#define AON_DIG_CFG_ONWAKE_RUN_SAR_BIT_OFFSET (1U)
#define AON_DIG_CFG_ONWAKE_RUN_SAR_BIT_LEN    (1U)
#define AON_DIG_CFG_ONWAKE_RUN_SAR_BIT_MASK   0x2U
#define AON_DIG_CFG_ONWAKE_AON_DLD_BIT_OFFSET (0U)
#define AON_DIG_CFG_ONWAKE_AON_DLD_BIT_LEN    (1U)
#define AON_DIG_CFG_ONWAKE_AON_DLD_BIT_MASK   0x1U

/******************************************************************************
 * @brief Bit definitions for register AON_CTRL
 **/
#define AON_CTRL_ID                         0xA0004UL
#define AON_CTRL_LEN                        (4U)
#define AON_CTRL_MASK                       0xFFFFFFFFUL
#define AON_CTRL_DCA_ENAB_BIT_OFFSET        (7U)
#define AON_CTRL_DCA_ENAB_BIT_LEN           (1U)
#define AON_CTRL_DCA_ENAB_BIT_MASK          0x80U
#define AON_CTRL_DCA_WRITE_HI_EN_BIT_OFFSET (5U)
#define AON_CTRL_DCA_WRITE_HI_EN_BIT_LEN    (1U)
#define AON_CTRL_DCA_WRITE_HI_EN_BIT_MASK   0x20U
#define AON_CTRL_DCA_WRITE_EN_BIT_OFFSET    (4U)
#define AON_CTRL_DCA_WRITE_EN_BIT_LEN       (1U)
#define AON_CTRL_DCA_WRITE_EN_BIT_MASK      0x10U
#define AON_CTRL_DCA_READ_EN_BIT_OFFSET     (3U)
#define AON_CTRL_DCA_READ_EN_BIT_LEN        (1U)
#define AON_CTRL_DCA_READ_EN_BIT_MASK       0x8U
#define AON_CTRL_CONFIG_UPLOAD_BIT_OFFSET   (2U)
#define AON_CTRL_CONFIG_UPLOAD_BIT_LEN      (1U)
#define AON_CTRL_CONFIG_UPLOAD_BIT_MASK     0x4U
#define AON_CTRL_ARRAY_SAVE_BIT_OFFSET      (1U)
#define AON_CTRL_ARRAY_SAVE_BIT_LEN         (1U)
#define AON_CTRL_ARRAY_SAVE_BIT_MASK        0x2U
#define AON_CTRL_ARRAY_RESTORE_BIT_OFFSET   (0U)
#define AON_CTRL_ARRAY_RESTORE_BIT_LEN      (1U)
#define AON_CTRL_ARRAY_RESTORE_BIT_MASK     0x1U

/******************************************************************************
 * @brief Bit definitions for register AON_RDATA
 **/
#define AON_RDATA_ID               0xA0008UL
#define AON_RDATA_LEN              (4U)
#define AON_RDATA_MASK             0xFFFFFFFFUL
#define AON_RDATA_RDATA_BIT_OFFSET (0U)
#define AON_RDATA_RDATA_BIT_LEN    (8U)
#define AON_RDATA_RDATA_BIT_MASK   0xffU

/******************************************************************************
 * @brief Bit definitions for register AON_ADDR
 **/
#define AON_ADDR_ID              0xA000CUL
#define AON_ADDR_LEN             (4U)
#define AON_ADDR_MASK            0xFFFFFFFFUL
#define AON_ADDR_ADDR_BIT_OFFSET (0U)
#define AON_ADDR_ADDR_BIT_LEN    (9U)
#define AON_ADDR_ADDR_BIT_MASK   0x1ffU

/******************************************************************************
 * @brief Bit definitions for register AON_WDATA
 **/
#define AON_WDATA_ID               0xA0010UL
#define AON_WDATA_LEN              (4U)
#define AON_WDATA_MASK             0xFFFFFFFFUL
#define AON_WDATA_WDATA_BIT_OFFSET (0U)
#define AON_WDATA_WDATA_BIT_LEN    (8U)
#define AON_WDATA_WDATA_BIT_MASK   0xffU

/******************************************************************************
 * @brief Bit definitions for register ANA_CFG
 **/
#define ANA_CFG_ID                    0xA0014UL
#define ANA_CFG_LEN                   (4U)
#define ANA_CFG_MASK                  0xFFFFFFFFUL
#define ANA_CFG_PRES_SLEEP_BIT_OFFSET (5U)
#define ANA_CFG_PRES_SLEEP_BIT_LEN    (1U)
#define ANA_CFG_PRES_SLEEP_BIT_MASK   0x20U
#define ANA_CFG_WAKE_WUP_BIT_OFFSET   (4U)
#define ANA_CFG_WAKE_WUP_BIT_LEN      (1U)
#define ANA_CFG_WAKE_WUP_BIT_MASK     0x10U
#define ANA_CFG_WAKE_CSN_BIT_OFFSET   (3U)
#define ANA_CFG_WAKE_CSN_BIT_LEN      (1U)
#define ANA_CFG_WAKE_CSN_BIT_MASK     0x8U
#define ANA_CFG_BROUT_EN_BIT_OFFSET   (2U)
#define ANA_CFG_BROUT_EN_BIT_LEN      (1U)
#define ANA_CFG_BROUT_EN_BIT_MASK     0x4U
#define ANA_CFG_WAKE_CNT_BIT_OFFSET   (1U)
#define ANA_CFG_WAKE_CNT_BIT_LEN      (1U)
#define ANA_CFG_WAKE_CNT_BIT_MASK     0x2U
#define ANA_CFG_SLEEP_EN_BIT_OFFSET   (0U)
#define ANA_CFG_SLEEP_EN_BIT_LEN      (1U)
#define ANA_CFG_SLEEP_EN_BIT_MASK     0x1U

/******************************************************************************
 * @brief Bit definitions for register OTP_WDATA
 **/
#define OTP_WDATA_ID                   0xB0000UL
#define OTP_WDATA_LEN                  (4U)
#define OTP_WDATA_MASK                 0xFFFFFFFFUL
#define OTP_WDATA_OTP_WDATA_BIT_OFFSET (0U)
#define OTP_WDATA_OTP_WDATA_BIT_LEN    (32U)
#define OTP_WDATA_OTP_WDATA_BIT_MASK   0xffffffffUL

/******************************************************************************
 * @brief Bit definitions for register OTP_ADDR
 **/
#define OTP_ADDR_ID                  0xB0004UL
#define OTP_ADDR_LEN                 (4U)
#define OTP_ADDR_MASK                0xFFFFFFFFUL
#define OTP_ADDR_OTP_ADDR_BIT_OFFSET (0U)
#define OTP_ADDR_OTP_ADDR_BIT_LEN    (11U)
#define OTP_ADDR_OTP_ADDR_BIT_MASK   0x7ffU

/******************************************************************************
 * @brief Bit definitions for register OTP_CFG
 **/
#define OTP_CFG_ID                        0xB0008UL
#define OTP_CFG_LEN                       (4U)
#define OTP_CFG_MASK                      0xFFFFFFFFUL
#define OTP_CFG_DGC_SEL_BIT_OFFSET        (13U)
#define OTP_CFG_DGC_SEL_BIT_LEN           (1U)
#define OTP_CFG_DGC_SEL_BIT_MASK          0x2000UL
#define OTP_CFG_OPS_ID_BIT_OFFSET         (11U)
#define OTP_CFG_OPS_ID_BIT_LEN            (2U)
#define OTP_CFG_OPS_ID_BIT_MASK           0x1800UL
#define OTP_CFG_OPS_KICK_BIT_OFFSET       (10U)
#define OTP_CFG_OPS_KICK_BIT_LEN          (1U)
#define OTP_CFG_OPS_KICK_BIT_MASK         0x400UL
#define OTP_CFG_BIAS_KICK_BIT_OFFSET      (8U)
#define OTP_CFG_BIAS_KICK_BIT_LEN         (1U)
#define OTP_CFG_BIAS_KICK_BIT_MASK        0x100UL
#define OTP_CFG_LDO_KICK_BIT_OFFSET       (7U)
#define OTP_CFG_LDO_KICK_BIT_LEN          (1U)
#define OTP_CFG_LDO_KICK_BIT_MASK         0x80UL
#define OTP_CFG_DGC_KICK_BIT_OFFSET       (6U)
#define OTP_CFG_DGC_KICK_BIT_LEN          (1U)
#define OTP_CFG_DGC_KICK_BIT_MASK         0x40UL
#define OTP_CFG_OTP_WRITE_MR_BIT_OFFSET   (3U)
#define OTP_CFG_OTP_WRITE_MR_BIT_LEN      (1U)
#define OTP_CFG_OTP_WRITE_MR_BIT_MASK     0x8U
#define OTP_CFG_OTP_WRITE_BIT_OFFSET      (2U)
#define OTP_CFG_OTP_WRITE_BIT_LEN         (1U)
#define OTP_CFG_OTP_WRITE_BIT_MASK        0x4U
#define OTP_CFG_OTP_READ_BIT_OFFSET       (1U)
#define OTP_CFG_OTP_READ_BIT_LEN          (1U)
#define OTP_CFG_OTP_READ_BIT_MASK         0x2U
#define OTP_CFG_OTP_MAN_CTR_EN_BIT_OFFSET (0U)
#define OTP_CFG_OTP_MAN_CTR_EN_BIT_LEN    (1U)
#define OTP_CFG_OTP_MAN_CTR_EN_BIT_MASK   0x1U

