HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register OTP_STATUS
 **/
#define OTP_STATUS_ID                       0xB000CUL
#define OTP_STATUS_LEN                      (4U)
#define OTP_STATUS_MASK                     0xFFFFFFFFUL
#define OTP_STATUS_OTP_VPP_OK_BIT_OFFSET    (1U)
#define OTP_STATUS_OTP_VPP_OK_BIT_LEN       (1U)
#define OTP_STATUS_OTP_VPP_OK_BIT_MASK      0x2U
#define OTP_STATUS_OTP_PROG_DONE_BIT_OFFSET (0U)
#define OTP_STATUS_OTP_PROG_DONE_BIT_LEN    (1U)
#define OTP_STATUS_OTP_PROG_DONE_BIT_MASK   0x1U

/******************************************************************************
 * @brief Bit definitions for register OTP_RDATA
 **/
#define OTP_RDATA_ID                   0xB0010UL
#define OTP_RDATA_LEN                  (4U)
#define OTP_RDATA_MASK                 0xFFFFFFFFUL
#define OTP_RDATA_OTP_RDATA_BIT_OFFSET (0U)
#define OTP_RDATA_OTP_RDATA_BIT_LEN    (32U)
#define OTP_RDATA_OTP_RDATA_BIT_MASK   0xffffffffUL

/******************************************************************************
 * @brief Bit definitions for register IP_TOA_LO
 **/
#define IP_TOA_LO_ID                0xC0000UL
#define IP_TOA_LO_LEN               (4U)
#define IP_TOA_LO_MASK              0xFFFFFFFFUL
#define IP_TOA_LO_IP_TOA_BIT_OFFSET (0U)
#define IP_TOA_LO_IP_TOA_BIT_LEN    (32U)
#define IP_TOA_LO_IP_TOA_BIT_MASK   0xffffffffUL

/******************************************************************************
 * @brief Bit definitions for register IP_TOA_HI
 **/
#define IP_TOA_HI_ID                  0xC0004UL
#define IP_TOA_HI_LEN                 (4U)
#define IP_TOA_HI_MASK                0xFFFFFFFFUL
#define IP_TOA_HI_IP_TOAST_BIT_OFFSET (24U)
#define IP_TOA_HI_IP_TOAST_BIT_LEN    (8U)
#define IP_TOA_HI_IP_TOAST_BIT_MASK   0xff000000UL
#define IP_TOA_HI_IP_POA_BIT_OFFSET   (8U)
#define IP_TOA_HI_IP_POA_BIT_LEN      (14U)
#define IP_TOA_HI_IP_POA_BIT_MASK     0x3fff00UL
#define IP_TOA_HI_IP_TOA_BIT_OFFSET   (0U)
#define IP_TOA_HI_IP_TOA_BIT_LEN      (8U)
#define IP_TOA_HI_IP_TOA_BIT_MASK     0xffU

/******************************************************************************
 * @brief Bit definitions for register STS_TOA_LO
 **/
#define STS_TOA_LO_ID                 0xC0008UL
#define STS_TOA_LO_LEN                (4U)
#define STS_TOA_LO_MASK               0xFFFFFFFFUL
#define STS_TOA_LO_STS_TOA_BIT_OFFSET (0U)
#define STS_TOA_LO_STS_TOA_BIT_LEN    (32U)
#define STS_TOA_LO_STS_TOA_BIT_MASK   0xffffffffUL

/******************************************************************************
 * @brief Bit definitions for register STS_TOA_HI
 **/
#define STS_TOA_HI_ID                   0xC000CUL
#define STS_TOA_HI_LEN                  (4U)
#define STS_TOA_HI_MASK                 0xFFFFFFFFUL
#define STS_TOA_HI_STS_TOAST_BIT_OFFSET (23U)
#define STS_TOA_HI_STS_TOAST_BIT_LEN    (9U)
#define STS_TOA_HI_STS_TOAST_BIT_MASK   0xff800000UL
#define STS_TOA_HI_STS_POA_BIT_OFFSET   (8U)
#define STS_TOA_HI_STS_POA_BIT_LEN      (14U)
#define STS_TOA_HI_STS_POA_BIT_MASK     0x3fff00UL
#define STS_TOA_HI_STS_TOA_BIT_OFFSET   (0U)
#define STS_TOA_HI_STS_TOA_BIT_LEN      (8U)
#define STS_TOA_HI_STS_TOA_BIT_MASK     0xffU

/******************************************************************************
 * @brief Bit definitions for register STS1_TOA_LO
 **/
#define STS1_TOA_LO_ID                  0xC0010UL
#define STS1_TOA_LO_LEN                 (4U)
#define STS1_TOA_LO_MASK                0xFFFFFFFFUL
#define STS1_TOA_LO_STS1_TOA_BIT_OFFSET (0U)
#define STS1_TOA_LO_STS1_TOA_BIT_LEN    (32U)
#define STS1_TOA_LO_STS1_TOA_BIT_MASK   0xffffffffUL

/******************************************************************************
 * @brief Bit definitions for register STS1_TOA_HI
 **/
#define STS1_TOA_HI_ID                    0xC0014UL
#define STS1_TOA_HI_LEN                   (4U)
#define STS1_TOA_HI_MASK                  0xFFFFFFFFUL
#define STS1_TOA_HI_STS1_TOAST_BIT_OFFSET (23U)
#define STS1_TOA_HI_STS1_TOAST_BIT_LEN    (9U)
#define STS1_TOA_HI_STS1_TOAST_BIT_MASK   0xff800000UL
#define STS1_TOA_HI_STS1_POA_BIT_OFFSET   (8U)
#define STS1_TOA_HI_STS1_POA_BIT_LEN      (14U)
#define STS1_TOA_HI_STS1_POA_BIT_MASK     0x3fff00UL
#define STS1_TOA_HI_STS1_TOA_BIT_OFFSET   (0U)
#define STS1_TOA_HI_STS1_TOA_BIT_LEN      (8U)
#define STS1_TOA_HI_STS1_TOA_BIT_MASK     0xffU

/******************************************************************************
 * @brief Bit definitions for register CIA_TDOA_0
 **/
#define CIA_TDOA_0_ID              0xC0018UL
#define CIA_TDOA_0_LEN             (4U)
#define CIA_TDOA_0_MASK            0xFFFFFFFFUL
#define CIA_TDOA_0_TDOA_BIT_OFFSET (0U)
#define CIA_TDOA_0_TDOA_BIT_LEN    (32U)
#define CIA_TDOA_0_TDOA_BIT_MASK   0xffffffffUL

/******************************************************************************
 * @brief Bit definitions for register CIA_TDOA_1_PDOA
 **/
#define CIA_TDOA_1_PDOA_ID                  0xC001CUL
#define CIA_TDOA_1_PDOA_LEN                 (4U)
#define CIA_TDOA_1_PDOA_MASK                0xFFFFFFFFUL
#define CIA_TDOA_1_PDOA_FP_TH_MD_BIT_OFFSET (30U)
#define CIA_TDOA_1_PDOA_FP_TH_MD_BIT_LEN    (1U)
#define CIA_TDOA_1_PDOA_FP_TH_MD_BIT_MASK   0x40000000UL
#define CIA_TDOA_1_PDOA_PDOA_BIT_OFFSET     (16U)
#define CIA_TDOA_1_PDOA_PDOA_BIT_LEN        (14U)
#define CIA_TDOA_1_PDOA_PDOA_BIT_MASK       0x3fff0000UL
#define CIA_TDOA_1_PDOA_TDOA_BIT_OFFSET     (0U)
#define CIA_TDOA_1_PDOA_TDOA_BIT_LEN        (9U)
#define CIA_TDOA_1_PDOA_TDOA_BIT_MASK       0x1ffU

/******************************************************************************
 * @brief Bit definitions for register CIA_DIAG_0
 **/
#define CIA_DIAG_0_ID                 0xC0020UL
#define CIA_DIAG_0_LEN                (4U)
#define CIA_DIAG_0_MASK               0xFFFFFFFFUL
#define CIA_DIAG_0_COE_PPM_BIT_OFFSET (0U)
#define CIA_DIAG_0_COE_PPM_BIT_LEN    (13U)
#define CIA_DIAG_0_COE_PPM_BIT_MASK   0x1fffU
#define B12_U16_SIGN_EXTEND_TEST (1U<<12) /* bit B12 as 12 = CIA_DIAG_0_COE_PPM_BIT_LEN-1 */
#define B12_U16_SIGN_EXTEND_MASK (0xF000U)

