HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register CIA_DIAG_1
 **/
#define CIA_DIAG_1_ID   0xC0024UL
#define CIA_DIAG_1_LEN  (4U)
#define CIA_DIAG_1_MASK 0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_0
**/
#define IP_DIAG_0_ID                         0xC0028UL
#define IP_DIAG_0_LEN                        (4U)
#define IP_DIAG_0_MASK                       0xFFFFFFFFUL
#define IP_DIAG_0_PEAKLOC_BIT_OFFSET         (21U)
#define IP_DIAG_0_PEAKLOC_BIT_LEN            (10U)
#define IP_DIAG_0_PEAKLOC_BIT_MASK           0x7fe00000UL

/******************************************************************************
 * @brief Bit definitions for register IP_DIAG_1
 **/
#define IP_DIAG_1_ID                       0xC002CUL
#define IP_DIAG_1_LEN                      (4U)
#define IP_DIAG_1_MASK                     0xFFFFFFFFUL
#define IP_DIAG_1_IPCHANNELAREA_BIT_OFFSET (0U)
#define IP_DIAG_1_IPCHANNELAREA_BIT_LEN    (17U)
#define IP_DIAG_1_IPCHANNELAREA_BIT_MASK   0x1ffffUL

/******************************************************************************
 * @brief Bit definitions for register IP_DIAG_2
 **/
#define IP_DIAG_2_ID              0xC0030UL
#define IP_DIAG_2_LEN             (4U)
#define IP_DIAG_2_MASK            0xFFFFFFFFUL
#define IP_DIAG_2_IPF1_BIT_OFFSET (0U)
#define IP_DIAG_2_IPF1_BIT_LEN    (22U)
#define IP_DIAG_2_IPF1_BIT_MASK   0x3fffffUL

/******************************************************************************
 * @brief Bit definitions for register IP_DIAG_3
 **/
#define IP_DIAG_3_ID              0xC0034UL
#define IP_DIAG_3_LEN             (4U)
#define IP_DIAG_3_MASK            0xFFFFFFFFUL
#define IP_DIAG_3_IPF2_BIT_OFFSET (0U)
#define IP_DIAG_3_IPF2_BIT_LEN    (22U)
#define IP_DIAG_3_IPF2_BIT_MASK   0x3fffffUL

/******************************************************************************
 * @brief Bit definitions for register IP_DIAG_4
 **/
#define IP_DIAG_4_ID              0xC0038UL
#define IP_DIAG_4_LEN             (4U)
#define IP_DIAG_4_MASK            0xFFFFFFFFUL
#define IP_DIAG_4_IPF3_BIT_OFFSET (0U)
#define IP_DIAG_4_IPF3_BIT_LEN    (22U)
#define IP_DIAG_4_IPF3_BIT_MASK   0x3fffffUL

/******************************************************************************
 * @brief Bit definitions for register IP_DIAG_5
 **/
#define IP_DIAG_5_ID   0xC003CUL
#define IP_DIAG_5_LEN  (4U)
#define IP_DIAG_5_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register IP_DIAG_6
 **/
#define IP_DIAG_6_ID   0xC0040UL
#define IP_DIAG_6_LEN  (4U)
#define IP_DIAG_6_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register IP_DIAG_7
 **/
#define IP_DIAG_7_ID   0xC0044UL
#define IP_DIAG_7_LEN  (4U)
#define IP_DIAG_7_MASK 0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_8
**/
#define IP_DIAG_8_ID                         0xC0048UL
#define IP_DIAG_8_LEN                        (4U)
#define IP_DIAG_8_MASK                       0xFFFFFFFFUL
#define IP_DIAG_8_IPFPLOC_BIT_OFFSET         (0U)
#define IP_DIAG_8_IPFPLOC_BIT_LEN            (16U)
#define IP_DIAG_8_IPFPLOC_BIT_MASK           0xffffUL

/******************************************************************************
 * @brief Bit definitions for register IP_DIAG_9
 **/
#define IP_DIAG_9_ID   0xC004CUL
#define IP_DIAG_9_LEN  (4U)
#define IP_DIAG_9_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register IP_DIAG_10
 **/
#define IP_DIAG_10_ID   0xC0050UL
#define IP_DIAG_10_LEN  (4U)
#define IP_DIAG_10_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register IP_DIAG_11
 **/
#define IP_DIAG_11_ID   0xC0054UL
#define IP_DIAG_11_LEN  (4U)
#define IP_DIAG_11_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register IP_DIAG_12
 **/
#define IP_DIAG_12_ID                0xC0058UL
#define IP_DIAG_12_LEN               (4U)
#define IP_DIAG_12_MASK              0xFFFFFFFFUL
#define IP_DIAG_12_IPNACC_BIT_OFFSET (0U)
#define IP_DIAG_12_IPNACC_BIT_LEN    (12U)
#define IP_DIAG_12_IPNACC_BIT_MASK   0xfffU

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_0
 **/
#define STS_DIAG_0_ID   0xC005CUL
#define STS_DIAG_0_LEN  (4U)
#define STS_DIAG_0_MASK 0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_1
**/
#define STS_DIAG_1_ID                        0xC0060UL
#define STS_DIAG_1_LEN                       (4U)
#define STS_DIAG_1_MASK                      0xFFFFFFFFUL
#define STS_DIAG_1_CY0CHANNELAREA_BIT_OFFSET (0U)
#define STS_DIAG_1_CY0CHANNELAREA_BIT_LEN    (20U)
#define STS_DIAG_1_CY0CHANNELAREA_BIT_MASK   0xfffffUL

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_2
**/
#define STS_DIAG_2_ID                        0xC0064UL
#define STS_DIAG_2_LEN                       (4U)
#define STS_DIAG_2_MASK                      0xFFFFFFFFUL
#define STS_DIAG_2_CY0F1_BIT_OFFSET          (0U)
#define STS_DIAG_2_CY0F1_BIT_LEN             (22U)
#define STS_DIAG_2_CY0F1_BIT_MASK            0x3fffffUL

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_3
**/
#define STS_DIAG_3_ID                        0xC0068UL
#define STS_DIAG_3_LEN                       (4U)
#define STS_DIAG_3_MASK                      0xFFFFFFFFUL
#define STS_DIAG_3_CY0F2_BIT_OFFSET          (0U)
#define STS_DIAG_3_CY0F2_BIT_LEN             (22U)
#define STS_DIAG_3_CY0F2_BIT_MASK            0x3fffffUL

