HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
* @brief Bit definitions for register STS_DIAG_4
**/
#define STS_DIAG_4_ID                        0xD0000UL
#define STS_DIAG_4_LEN                       (4U)
#define STS_DIAG_4_MASK                      0xFFFFFFFFUL
#define STS_DIAG_4_CY0F3_BIT_OFFSET          (0U)
#define STS_DIAG_4_CY0F3_BIT_LEN             (22U)
#define STS_DIAG_4_CY0F3_BIT_MASK            0x3fffffUL

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_5
 **/
#define STS_DIAG_5_ID   0xD0004UL
#define STS_DIAG_5_LEN  (4U)
#define STS_DIAG_5_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_6
 **/
#define STS_DIAG_6_ID   0xD0008UL
#define STS_DIAG_6_LEN  (4U)
#define STS_DIAG_6_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_7
 **/
#define STS_DIAG_7_ID   0xD000CUL
#define STS_DIAG_7_LEN  (4U)
#define STS_DIAG_7_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_8
 **/
#define STS_DIAG_8_ID   0xD0010UL
#define STS_DIAG_8_LEN  (4U)
#define STS_DIAG_8_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_9
 **/
#define STS_DIAG_9_ID   0xD0014UL
#define STS_DIAG_9_LEN  (4U)
#define STS_DIAG_9_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_10
 **/
#define STS_DIAG_10_ID   0xD0018UL
#define STS_DIAG_10_LEN  (4U)
#define STS_DIAG_10_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_11
 **/
#define STS_DIAG_11_ID   0xD001CUL
#define STS_DIAG_11_LEN  (4U)
#define STS_DIAG_11_MASK 0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_12
**/
#define STS_DIAG_12_ID                       0xD0020UL
#define STS_DIAG_12_LEN                      (4U)
#define STS_DIAG_12_MASK                     0xFFFFFFFFUL
#define STS_DIAG_12_SFDPHASECOUNT_BIT_OFFSET (12U)
#define STS_DIAG_12_SFDPHASECOUNT_BIT_LEN    (12U)
#define STS_DIAG_12_SFDPHASECOUNT_BIT_MASK   0xfff000UL
#define STS_DIAG_12_CYNACC_BIT_OFFSET        (0U)
#define STS_DIAG_12_CYNACC_BIT_LEN           (12U)
#define STS_DIAG_12_CYNACC_BIT_MASK          0xfffU

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_13
 **/
#define STS_DIAG_13_ID   0xD0024UL
#define STS_DIAG_13_LEN  (4U)
#define STS_DIAG_13_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_14
 **/
#define STS_DIAG_14_ID   0xD0028UL
#define STS_DIAG_14_LEN  (4U)
#define STS_DIAG_14_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_15
 **/
#define STS_DIAG_15_ID   0xD002CUL
#define STS_DIAG_15_LEN  (4U)
#define STS_DIAG_15_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_16
 **/
#define STS_DIAG_16_ID   0xD0030UL
#define STS_DIAG_16_LEN  (4U)
#define STS_DIAG_16_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_DIAG_17
 **/
#define STS_DIAG_17_ID   0xD0034UL
#define STS_DIAG_17_LEN  (4U)
#define STS_DIAG_17_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS1_DIAG_0
 **/
#define STS1_DIAG_0_ID   0xD0038UL
#define STS1_DIAG_0_LEN  (4U)
#define STS1_DIAG_0_MASK 0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_1
**/
#define STS1_DIAG_1_ID                       0xD003CUL
#define STS1_DIAG_1_LEN                      (4U)
#define STS1_DIAG_1_MASK                     0xFFFFFFFFUL
#define STS1_DIAG_1_CY1CHANNELAREA_BIT_OFFSET (0U)
#define STS1_DIAG_1_CY1CHANNELAREA_BIT_LEN   (20U)
#define STS1_DIAG_1_CY1CHANNELAREA_BIT_MASK  0xfffffUL

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_2
**/
#define STS1_DIAG_2_ID                       0xD0040UL
#define STS1_DIAG_2_LEN                      (4U)
#define STS1_DIAG_2_MASK                     0xFFFFFFFFUL
#define STS1_DIAG_2_CY1F1_BIT_OFFSET         (0U)
#define STS1_DIAG_2_CY1F1_BIT_LEN            (22U)
#define STS1_DIAG_2_CY1F1_BIT_MASK           0x3fffffUL

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_3
**/
#define STS1_DIAG_3_ID                       0xD0044UL
#define STS1_DIAG_3_LEN                      (4U)
#define STS1_DIAG_3_MASK                     0xFFFFFFFFUL
#define STS1_DIAG_3_CY1F2_BIT_OFFSET         (0U)
#define STS1_DIAG_3_CY1F2_BIT_LEN            (22U)
#define STS1_DIAG_3_CY1F2_BIT_MASK           0x3fffffUL

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_4
**/
#define STS1_DIAG_4_ID                       0xD0048UL
#define STS1_DIAG_4_LEN                      (4U)
#define STS1_DIAG_4_MASK                     0xFFFFFFFFUL
#define STS1_DIAG_4_CY1F3_BIT_OFFSET         (0U)
#define STS1_DIAG_4_CY1F3_BIT_LEN            (22U)
#define STS1_DIAG_4_CY1F3_BIT_MASK           0x3fffffUL

