HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register STS1_DIAG_5
 **/
#define STS1_DIAG_5_ID   0xD004CUL
#define STS1_DIAG_5_LEN  (4U)
#define STS1_DIAG_5_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS1_DIAG_6
 **/
#define STS1_DIAG_6_ID   0xD0050UL
#define STS1_DIAG_6_LEN  (4U)
#define STS1_DIAG_6_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS1_DIAG_7
 **/
#define STS1_DIAG_7_ID   0xD0054UL
#define STS1_DIAG_7_LEN  (4U)
#define STS1_DIAG_7_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS1_DIAG_8
 **/
#define STS1_DIAG_8_ID   0xD0058UL
#define STS1_DIAG_8_LEN  (4U)
#define STS1_DIAG_8_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS1_DIAG_9
 **/
#define STS1_DIAG_9_ID   0xD005CUL
#define STS1_DIAG_9_LEN  (4U)
#define STS1_DIAG_9_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS1_DIAG_10
 **/
#define STS1_DIAG_10_ID   0xD0060UL
#define STS1_DIAG_10_LEN  (4U)
#define STS1_DIAG_10_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS1_DIAG_11
 **/
#define STS1_DIAG_11_ID   0xD0064UL
#define STS1_DIAG_11_LEN  (4U)
#define STS1_DIAG_11_MASK 0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_12
**/
#define STS1_DIAG_12_ID                      0xD0068UL
#define STS1_DIAG_12_LEN                     (4U)
#define STS1_DIAG_12_MASK                    0xFFFFFFFFUL
#define STS1_DIAG_12_CY1NACC_BIT_OFFSET      (0U)
#define STS1_DIAG_12_CY1NACC_BIT_LEN         (12U)
#define STS1_DIAG_12_CY1NACC_BIT_MASK        0xfffU

/******************************************************************************
 * @brief Bit definitions for register CIA_CONF
 **/
#define CIA_CONF_ID                 0xE0000UL
#define CIA_CONF_LEN                (4U)
#define CIA_CONF_MASK               0xFFFFFFFFUL
#define CIA_CONF_MINDIAG_BIT_OFFSET (20U)
#define CIA_CONF_MINDIAG_BIT_LEN    (1U)
#define CIA_CONF_MINDIAG_BIT_MASK   0x100000UL
#define CIA_CONF_RXANTD_BIT_OFFSET  (0U)
#define CIA_CONF_RXANTD_BIT_LEN     (16U)
#define CIA_CONF_RXANTD_BIT_MASK    0xffffU

/******************************************************************************
 * @brief Bit definitions for register FP_CONF
 **/
#define FP_CONF_ID                      0xE0004UL
#define FP_CONF_LEN                     (4U)
#define FP_CONF_MASK                    0xFFFFFFFFUL
#define FP_CONF_TC_RXDLY_EN_BIT_OFFSET  (20U)
#define FP_CONF_TC_RXDLY_EN_BIT_LEN     (1U)
#define FP_CONF_TC_RXDLY_EN_BIT_MASK    0x100000UL
#define FP_CONF_CAL_TEMP_BIT_OFFSET     (11U)
#define FP_CONF_CAL_TEMP_BIT_LEN        (8U)
#define FP_CONF_CAL_TEMP_BIT_MASK       0x7f800UL
#define FP_CONF_FP_AGREED_TH_BIT_OFFSET (8U)
#define FP_CONF_FP_AGREED_TH_BIT_LEN    (3U)
#define FP_CONF_FP_AGREED_TH_BIT_MASK   0x700U

/******************************************************************************
 * @brief Bit definitions for register IP_CONFIG_LO
 **/
#define IP_CONFIG_LO_ID                  0xE000CUL
#define IP_CONFIG_LO_LEN                 (2U)
#define IP_CONFIG_LO_MASK                0xFFFFU
#define IP_CONFIG_LO_IP_PMULT_BIT_OFFSET (5U)
#define IP_CONFIG_LO_IP_PMULT_BIT_LEN    (2U)
#define IP_CONFIG_LO_IP_PMULT_BIT_MASK   0x60U
#define IP_CONFIG_LO_IP_NTM_BIT_OFFSET   (0U)
#define IP_CONFIG_LO_IP_NTM_BIT_LEN      (5U)
#define IP_CONFIG_LO_IP_NTM_BIT_MASK     0x1fU

/******************************************************************************
 * @brief Bit definitions for register IP_CONFIG_HI
 **/
#define IP_CONFIG_HI_ID                0xE000EUL
#define IP_CONFIG_HI_LEN               (4U)
#define IP_CONFIG_HI_MASK              0xFFFFFFFFUL
#define IP_CONFIG_HI_IP_RTM_BIT_OFFSET (0U)
#define IP_CONFIG_HI_IP_RTM_BIT_LEN    (5U)
#define IP_CONFIG_HI_IP_RTM_BIT_MASK   0x1fU

/******************************************************************************
 * @brief Bit definitions for register STS_CONFIG_LO
 **/
#define STS_CONFIG_LO_ID                    0xE0012UL
#define STS_CONFIG_LO_LEN                   (4U)
#define STS_CONFIG_LO_MASK                  0xFFFFFFFFUL
#define STS_CONFIG_LO_STS_MAN_TH_BIT_OFFSET (16U)
#define STS_CONFIG_LO_STS_MAN_TH_BIT_LEN    (7U)
#define STS_CONFIG_LO_STS_MAN_TH_BIT_MASK   0x7f0000UL
#define STS_CONFIG_LO_STS_PMULT_BIT_OFFSET  (5U)
#define STS_CONFIG_LO_STS_PMULT_BIT_LEN     (2U)
#define STS_CONFIG_LO_STS_PMULT_BIT_MASK    0x60U
#define STS_CONFIG_LO_STS_NTM_BIT_OFFSET    (0U)
#define STS_CONFIG_LO_STS_NTM_BIT_LEN       (5U)
#define STS_CONFIG_LO_STS_NTM_BIT_MASK      0x1fU

/******************************************************************************
 * @brief Bit definitions for register STS_CONFIG_HI
 **/
#define STS_CONFIG_HI_ID                      0xE0016UL
#define STS_CONFIG_HI_LEN                     (4U)
#define STS_CONFIG_HI_MASK                    0xFFFFFFFFUL
#define STS_CONFIG_HI_STS_PGR_EN_BIT_OFFSET   (31U)
#define STS_CONFIG_HI_STS_PGR_EN_BIT_LEN      (1U)
#define STS_CONFIG_HI_STS_PGR_EN_BIT_MASK     0x80000000UL
#define STS_CONFIG_HI_STS_SS_EN_BIT_OFFSET    (30U)
#define STS_CONFIG_HI_STS_SS_EN_BIT_LEN       (1U)
#define STS_CONFIG_HI_STS_SS_EN_BIT_MASK      0x40000000UL
#define STS_CONFIG_HI_STS_CQ_EN_BIT_OFFSET    (29U)
#define STS_CONFIG_HI_STS_CQ_EN_BIT_LEN       (1U)
#define STS_CONFIG_HI_STS_CQ_EN_BIT_MASK      0x20000000UL
#define STS_CONFIG_HI_FP_AGREED_EN_BIT_OFFSET (28U)
#define STS_CONFIG_HI_FP_AGREED_EN_BIT_LEN    (1U)
#define STS_CONFIG_HI_FP_AGREED_EN_BIT_MASK   0x10000000UL
#define STS_CONFIG_HI_RES_B0_BIT_OFFSET       (4U)
#define STS_CONFIG_HI_RES_B0_BIT_LEN          (4U)
#define STS_CONFIG_HI_RES_B0_BIT_MASK         0xf0U

