HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register CIA_ADJUST
 **/
#define CIA_ADJUST_ID                         0xE001AUL
#define CIA_ADJUST_LEN                        (4U)
#define CIA_ADJUST_MASK                       0xFFFFFFFFUL
#define CIA_ADJUST_PDOA_ADJ_OFFSET_BIT_OFFSET (0U)
#define CIA_ADJUST_PDOA_ADJ_OFFSET_BIT_LEN    (14U)
#define CIA_ADJUST_PDOA_ADJ_OFFSET_BIT_MASK   0x3fffU

/******************************************************************************
 * @brief Bit definitions for register PGF_DELAY_COMP_LO
 **/
#define PGF_DELAY_COMP_LO_ID   0xE001EUL
#define PGF_DELAY_COMP_LO_LEN  (4U)
#define PGF_DELAY_COMP_LO_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register PGF_DELAY_COMP_HI
 **/
#define PGF_DELAY_COMP_HI_ID   0xE0022UL
#define PGF_DELAY_COMP_HI_LEN  (4U)
#define PGF_DELAY_COMP_HI_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register EVC_CTRL
 **/
#define EVC_CTRL_ID                 0xF0000UL
#define EVC_CTRL_LEN                (4U)
#define EVC_CTRL_MASK               0xFFFFFFFFUL
#define EVC_CTRL_EVC_CLR_BIT_OFFSET (1U)
#define EVC_CTRL_EVC_CLR_BIT_LEN    (1U)
#define EVC_CTRL_EVC_CLR_BIT_MASK   0x2U
#define EVC_CTRL_EVC_EN_BIT_OFFSET  (0U)
#define EVC_CTRL_EVC_EN_BIT_LEN     (1U)
#define EVC_CTRL_EVC_EN_BIT_MASK    0x1U

/******************************************************************************
 * @brief Bit definitions for register EVC_COUNT0
 **/
#define EVC_COUNT0_ID                 0xF0004UL
#define EVC_COUNT0_LEN                (4U)
#define EVC_COUNT0_MASK               0xFFFFFFFFUL
#define EVC_COUNT0_EVC_RSE_BIT_OFFSET (16U)
#define EVC_COUNT0_EVC_RSE_BIT_LEN    (12U)
#define EVC_COUNT0_EVC_RSE_BIT_MASK   0xfff0000UL
#define EVC_COUNT0_EVC_PHE_BIT_OFFSET (0U)
#define EVC_COUNT0_EVC_PHE_BIT_LEN    (12U)
#define EVC_COUNT0_EVC_PHE_BIT_MASK   0xfffU

/******************************************************************************
 * @brief Bit definitions for register EVC_COUNT1
 **/
#define EVC_COUNT1_ID                 0xF0008UL
#define EVC_COUNT1_LEN                (4U)
#define EVC_COUNT1_MASK               0xFFFFFFFFUL
#define EVC_COUNT1_EVC_FCE_BIT_OFFSET (16U)
#define EVC_COUNT1_EVC_FCE_BIT_LEN    (12U)
#define EVC_COUNT1_EVC_FCE_BIT_MASK   0xfff0000UL
#define EVC_COUNT1_EVC_FCG_BIT_OFFSET (0U)
#define EVC_COUNT1_EVC_FCG_BIT_LEN    (12U)
#define EVC_COUNT1_EVC_FCG_BIT_MASK   0xfffU

/******************************************************************************
 * @brief Bit definitions for register EVC_COUNT2
 **/
#define EVC_COUNT2_ID                 0xF000CUL
#define EVC_COUNT2_LEN                (4U)
#define EVC_COUNT2_MASK               0xFFFFFFFFUL
#define EVC_COUNT2_EVC_OVR_BIT_OFFSET (16U)
#define EVC_COUNT2_EVC_OVR_BIT_LEN    (8U)
#define EVC_COUNT2_EVC_OVR_BIT_MASK   0xff0000UL
#define EVC_COUNT2_EVC_FFR_BIT_OFFSET (0U)
#define EVC_COUNT2_EVC_FFR_BIT_LEN    (8U)
#define EVC_COUNT2_EVC_FFR_BIT_MASK   0xffU

/******************************************************************************
 * @brief Bit definitions for register EVC_COUNT3
 **/
#define EVC_COUNT3_ID                 0xF0010UL
#define EVC_COUNT3_LEN                (4U)
#define EVC_COUNT3_MASK               0xFFFFFFFFUL
#define EVC_COUNT3_EVC_PTO_BIT_OFFSET (16U)
#define EVC_COUNT3_EVC_PTO_BIT_LEN    (12U)
#define EVC_COUNT3_EVC_PTO_BIT_MASK   0xfff0000UL
#define EVC_COUNT3_EVC_STO_BIT_OFFSET (0U)
#define EVC_COUNT3_EVC_STO_BIT_LEN    (12U)
#define EVC_COUNT3_EVC_STO_BIT_MASK   0xfffU

/******************************************************************************
 * @brief Bit definitions for register EVC_COUNT4
 **/
#define EVC_COUNT4_ID                  0xF0014UL
#define EVC_COUNT4_LEN                 (4U)
#define EVC_COUNT4_MASK                0xFFFFFFFFUL
#define EVC_COUNT4_EVC_TXFS_BIT_OFFSET (16U)
#define EVC_COUNT4_EVC_TXFS_BIT_LEN    (12U)
#define EVC_COUNT4_EVC_TXFS_BIT_MASK   0xfff0000UL
#define EVC_COUNT4_EVC_FWTO_BIT_OFFSET (0U)
#define EVC_COUNT4_EVC_FWTO_BIT_LEN    (8U)
#define EVC_COUNT4_EVC_FWTO_BIT_MASK   0xffU

/******************************************************************************
 * @brief Bit definitions for register EVC_COUNT5
 **/
#define EVC_COUNT5_ID                  0xF0018UL
#define EVC_COUNT5_LEN                 (4U)
#define EVC_COUNT5_MASK                0xFFFFFFFFUL
#define EVC_COUNT5_EVC_SWCE_BIT_OFFSET (16U)
#define EVC_COUNT5_EVC_SWCE_BIT_LEN    (8U)
#define EVC_COUNT5_EVC_SWCE_BIT_MASK   0xff0000UL
#define EVC_COUNT5_EVC_HPW_BIT_OFFSET  (0U)
#define EVC_COUNT5_EVC_HPW_BIT_LEN     (8U)
#define EVC_COUNT5_EVC_HPW_BIT_MASK    0xffU

/******************************************************************************
 * @brief Bit definitions for register EVC_COUNT6
 **/
#define EVC_COUNT6_ID                  0xF001CUL
#define EVC_COUNT6_LEN                 (4U)
#define EVC_COUNT6_MASK                0xFFFFFFFFUL
#define EVC_COUNT6_EVC_PREJ_BIT_OFFSET (0U)
#define EVC_COUNT6_EVC_PREJ_BIT_LEN    (12U)
#define EVC_COUNT6_EVC_PREJ_BIT_MASK   0xfffU

/******************************************************************************
 * @brief Bit definitions for register TEST_CTRL0
 **/
#define TEST_CTRL0_ID                  0xF0024UL
#define TEST_CTRL0_LEN                 (4U)
#define TEST_CTRL0_MASK                0xFFFFFFFFUL
#define TEST_CTRL0_CIA_RUN_BIT_OFFSET  (26U)
#define TEST_CTRL0_CIA_RUN_BIT_LEN     (1U)
#define TEST_CTRL0_CIA_RUN_BIT_MASK    0x4000000UL
#define TEST_CTRL0_CIA_WDEN_BIT_OFFSET (24U)
#define TEST_CTRL0_CIA_WDEN_BIT_LEN    (1U)
#define TEST_CTRL0_CIA_WDEN_BIT_MASK   0x1000000UL
#define TEST_CTRL0_HIRQ_POL_BIT_OFFSET (21U)
#define TEST_CTRL0_HIRQ_POL_BIT_LEN    (1U)
#define TEST_CTRL0_HIRQ_POL_BIT_MASK   0x200000UL
#define TEST_CTRL0_TX_PSTM_BIT_OFFSET  (4U)
#define TEST_CTRL0_TX_PSTM_BIT_LEN     (1U)
#define TEST_CTRL0_TX_PSTM_BIT_MASK    0x10U

