HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register EVC_COUNT7
 **/
#define EVC_COUNT7_ID                   0xF0028UL
#define EVC_COUNT7_LEN                  (4U)
#define EVC_COUNT7_MASK                 0xFFFFFFFFUL
#define EVC_COUNT7_EVC_VWARN_BIT_OFFSET (16U)
#define EVC_COUNT7_EVC_VWARN_BIT_LEN    (8U)
#define EVC_COUNT7_EVC_VWARN_BIT_MASK   0xff0000UL
#define EVC_COUNT7_EVC_CPQE_BIT_OFFSET  (0U)
#define EVC_COUNT7_EVC_CPQE_BIT_LEN     (8U)
#define EVC_COUNT7_EVC_CPQE_BIT_MASK    0xffU

/******************************************************************************
 * @brief Bit definitions for register SPI_MODE
 **/
#define SPI_MODE_ID                  0xF002CUL
#define SPI_MODE_LEN                 (4U)
#define SPI_MODE_MASK                0xFFFFFFFFUL
#define SPI_MODE_SPI_MODE_BIT_OFFSET (0U)
#define SPI_MODE_SPI_MODE_BIT_LEN    (2U)
#define SPI_MODE_SPI_MODE_BIT_MASK   0x3U

/******************************************************************************
 * @brief Bit definitions for register SYS_STATE_LO
 **/
#define SYS_STATE_LO_ID   0xF0030UL
#define SYS_STATE_LO_LEN  (4U)
#define SYS_STATE_LO_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register FCMD_STATUS
 **/
#define FCMD_STATUS_ID                     0xF003CUL
#define FCMD_STATUS_LEN                    (4U)
#define FCMD_STATUS_MASK                   0xFFFFFFFFUL
#define FCMD_STATUS_FCMD_STATUS_BIT_OFFSET (0U)
#define FCMD_STATUS_FCMD_STATUS_BIT_LEN    (5U)
#define FCMD_STATUS_FCMD_STATUS_BIT_MASK   0x1fU

/******************************************************************************
 * @brief Bit definitions for register CTR_DBG
 **/
#define CTR_DBG_ID                 0xF0048UL
#define CTR_DBG_LEN                (4U)
#define CTR_DBG_MASK               0xFFFFFFFFUL
#define CTR_DBG_CTR_DBG_BIT_OFFSET (0U)
#define CTR_DBG_CTR_DBG_BIT_LEN    (32U)
#define CTR_DBG_CTR_DBG_BIT_MASK   0xffffffffUL

/******************************************************************************
 * @brief Bit definitions for register SOFT_RST
 **/
#define SOFT_RST_ID   0x110000UL
#define SOFT_RST_LEN  (4U)
#define SOFT_RST_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register CLK_CTRL
 **/
#define CLK_CTRL_ID                       0x110004UL
#define CLK_CTRL_LEN                      (4U)
#define CLK_CTRL_MASK                     0xFFFFFFFFUL
#define CLK_CTRL_LP_CLK_EN_BIT_OFFSET     (23U)
#define CLK_CTRL_LP_CLK_EN_BIT_LEN        (1U)
#define CLK_CTRL_LP_CLK_EN_BIT_MASK       0x800000UL
#define CLK_CTRL_GPIO_DRST_N_BIT_OFFSET   (19U)
#define CLK_CTRL_GPIO_DRST_N_BIT_LEN      (1U)
#define CLK_CTRL_GPIO_DRST_N_BIT_MASK     0x80000UL
#define CLK_CTRL_GPIO_DCLK_EN_BIT_OFFSET  (18U)
#define CLK_CTRL_GPIO_DCLK_EN_BIT_LEN     (1U)
#define CLK_CTRL_GPIO_DCLK_EN_BIT_MASK    0x40000UL
#define CLK_CTRL_GPIO_CLK_EN_BIT_OFFSET   (16U)
#define CLK_CTRL_GPIO_CLK_EN_BIT_LEN      (1U)
#define CLK_CTRL_GPIO_CLK_EN_BIT_MASK     0x10000UL
#define CLK_CTRL_ACC_MCLK_EN_BIT_OFFSET   (15U)
#define CLK_CTRL_ACC_MCLK_EN_BIT_LEN      (1U)
#define CLK_CTRL_ACC_MCLK_EN_BIT_MASK     0x8000U
#define CLK_CTRL_TX_BUF_CLK_ON_BIT_OFFSET (12U)
#define CLK_CTRL_TX_BUF_CLK_ON_BIT_LEN    (1U)
#define CLK_CTRL_TX_BUF_CLK_ON_BIT_MASK   0x1000U
#define CLK_CTRL_RX_BUF_CLK_ON_BIT_OFFSET (11U)
#define CLK_CTRL_RX_BUF_CLK_ON_BIT_LEN    (1U)
#define CLK_CTRL_RX_BUF_CLK_ON_BIT_MASK   0x800U
#define CLK_CTRL_SAR_CLK_EN_BIT_OFFSET    (10U)
#define CLK_CTRL_SAR_CLK_EN_BIT_LEN       (1U)
#define CLK_CTRL_SAR_CLK_EN_BIT_MASK      0x400U
#define CLK_CTRL_OTP_CLK_EN_BIT_OFFSET    (9U)
#define CLK_CTRL_OTP_CLK_EN_BIT_LEN       (1U)
#define CLK_CTRL_OTP_CLK_EN_BIT_MASK      0x200U
#define CLK_CTRL_CIA_CLK_EN_BIT_OFFSET    (8U)
#define CLK_CTRL_CIA_CLK_EN_BIT_LEN       (1U)
#define CLK_CTRL_CIA_CLK_EN_BIT_MASK      0x100U
#define CLK_CTRL_ACC_CLK_EN_BIT_OFFSET    (6U)
#define CLK_CTRL_ACC_CLK_EN_BIT_LEN       (1U)
#define CLK_CTRL_ACC_CLK_EN_BIT_MASK      0x40U
#define CLK_CTRL_TX_CLK_SEL_BIT_OFFSET    (4U)
#define CLK_CTRL_TX_CLK_SEL_BIT_LEN       (2U)
#define CLK_CTRL_TX_CLK_SEL_BIT_MASK      0x30U
#define CLK_CTRL_RX_CLK_SEL_BIT_OFFSET    (2U)
#define CLK_CTRL_RX_CLK_SEL_BIT_LEN       (2U)
#define CLK_CTRL_RX_CLK_SEL_BIT_MASK      0xcU
#define CLK_CTRL_SYS_CLK_SEL_BIT_OFFSET   (0U)
#define CLK_CTRL_SYS_CLK_SEL_BIT_LEN      (2U)
#define CLK_CTRL_SYS_CLK_SEL_BIT_MASK     0x3U

/******************************************************************************
 * @brief Bit definitions for register SEQ_CTRL
 **/
#define SEQ_CTRL_ID                       0x110008UL
#define SEQ_CTRL_LEN                      (4U)
#define SEQ_CTRL_MASK                     0xFFFFFFFFUL
#define SEQ_CTRL_LP_CLK_DIV_BIT_OFFSET    (26U)
#define SEQ_CTRL_LP_CLK_DIV_BIT_LEN       (6U)
#define SEQ_CTRL_LP_CLK_DIV_BIT_MASK      0xfc000000UL
#define SEQ_CTRL_FORCE_SYNC_BIT_OFFSET    (25U)
#define SEQ_CTRL_FORCE_SYNC_BIT_LEN       (1U)
#define SEQ_CTRL_FORCE_SYNC_BIT_MASK      0x2000000UL
#define SEQ_CTRL_FORCE2INIT_BIT_OFFSET    (23U)
#define SEQ_CTRL_FORCE2INIT_BIT_LEN       (1U)
#define SEQ_CTRL_FORCE2INIT_BIT_MASK      0x800000UL
#define SEQ_CTRL_FORCE2IDLE_BIT_OFFSET    (22U)
#define SEQ_CTRL_FORCE2IDLE_BIT_LEN       (1U)
#define SEQ_CTRL_FORCE2IDLE_BIT_MASK      0x400000UL
#define SEQ_CTRL_CIA_SEQ_EN_BIT_OFFSET    (17U)
#define SEQ_CTRL_CIA_SEQ_EN_BIT_LEN       (1U)
#define SEQ_CTRL_CIA_SEQ_EN_BIT_MASK      0x20000UL
#define SEQ_CTRL_PLL_SYNC_MODE_BIT_OFFSET (15U)
#define SEQ_CTRL_PLL_SYNC_MODE_BIT_LEN    (1U)
#define SEQ_CTRL_PLL_SYNC_MODE_BIT_MASK   0x8000U
#define SEQ_CTRL_ARX2SLP_BIT_OFFSET       (12U)
#define SEQ_CTRL_ARX2SLP_BIT_LEN          (1U)
#define SEQ_CTRL_ARX2SLP_BIT_MASK         0x1000U
#define SEQ_CTRL_ATX2SLP_BIT_OFFSET       (11U)
#define SEQ_CTRL_ATX2SLP_BIT_LEN          (1U)
#define SEQ_CTRL_ATX2SLP_BIT_MASK         0x800U
#define SEQ_CTRL_AINIT2IDLE_BIT_OFFSET    (8U)
#define SEQ_CTRL_AINIT2IDLE_BIT_LEN       (1U)
#define SEQ_CTRL_AINIT2IDLE_BIT_MASK      0x100U

