HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/dw3000_deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register PWR_UP_TIMES_TXFINESEQ
 **/
#define PWR_UP_TIMES_TXFINESEQ_ID   0x110010UL
#define PWR_UP_TIMES_TXFINESEQ_LEN  (4U)
#define PWR_UP_TIMES_TXFINESEQ_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register LED_CTRL
 **/
#define LED_CTRL_ID                       0x110016UL
#define LED_CTRL_LEN                      (4U)
#define LED_CTRL_MASK                     0xFFFFFFFFUL
#define LED_CTRL_FORCE_TRIGGER_BIT_OFFSET (16U)
#define LED_CTRL_FORCE_TRIGGER_BIT_LEN    (4U)
#define LED_CTRL_FORCE_TRIGGER_BIT_MASK   0xf0000UL
#define LED_CTRL_BLINK_EN_BIT_OFFSET      (8U)
#define LED_CTRL_BLINK_EN_BIT_LEN         (1U)
#define LED_CTRL_BLINK_EN_BIT_MASK        0x100U

/******************************************************************************
 * @brief Bit definitions for register RX_SNIFF
 **/
#define RX_SNIFF_ID                   0x11001AUL
#define RX_SNIFF_LEN                  (4U)
#define RX_SNIFF_MASK                 0xFFFFFFFFUL
#define RX_SNIFF_SNIFF_OFF_BIT_OFFSET (8U)
#define RX_SNIFF_SNIFF_OFF_BIT_LEN    (8U)
#define RX_SNIFF_SNIFF_OFF_BIT_MASK   0xff00U
#define RX_SNIFF_SNIFF_ON_BIT_OFFSET  (0U)
#define RX_SNIFF_SNIFF_ON_BIT_LEN     (4U)
#define RX_SNIFF_SNIFF_ON_BIT_MASK    0xfU

/******************************************************************************
 * @brief Bit definitions for register BIAS_CTRL
 **/
#define BIAS_CTRL_ID              0x11001FUL
#define BIAS_CTRL_LEN             (4U)
#define BIAS_CTRL_MASK            0xFFFFFFFFUL
#define BIAS_CTRL_BIAS_BIT_OFFSET (0U)
#define BIAS_CTRL_BIAS_BIT_LEN    (5U)
#define BIAS_CTRL_BIAS_BIT_MASK   0x1FUL

/******************************************************************************
 * @brief Bit definitions for register FINT_STAT
 **/
#define FINT_STAT_ID                      0x1F0000UL
#define FINT_STAT_LEN                     (4U)
#define FINT_STAT_MASK                    0xFFFFFFFFUL
#define FINT_STAT_SYS_PANIC_BIT_OFFSET    (7U)
#define FINT_STAT_SYS_PANIC_BIT_LEN       (1U)
#define FINT_STAT_SYS_PANIC_BIT_MASK      0x80U
#define FINT_STAT_SYS_EVENT_BIT_OFFSET    (6U)
#define FINT_STAT_SYS_EVENT_BIT_LEN       (1U)
#define FINT_STAT_SYS_EVENT_BIT_MASK      0x40U
#define FINT_STAT_RXTO_BIT_OFFSET         (5U)
#define FINT_STAT_RXTO_BIT_LEN            (1U)
#define FINT_STAT_RXTO_BIT_MASK           0x20U
#define FINT_STAT_RXERR_BIT_OFFSET        (4U)
#define FINT_STAT_RXERR_BIT_LEN           (1U)
#define FINT_STAT_RXERR_BIT_MASK          0x10U
#define FINT_STAT_RXOK_BIT_OFFSET         (3U)
#define FINT_STAT_RXOK_BIT_LEN            (1U)
#define FINT_STAT_RXOK_BIT_MASK           0x8U
#define FINT_STAT_RXTSERR_BIT_OFFSET      (2U)
#define FINT_STAT_RXTSERR_BIT_LEN         (1U)
#define FINT_STAT_RXTSERR_BIT_MASK        0x4U
#define FINT_STAT_CCA_FAIL_AAT_BIT_OFFSET (1U)
#define FINT_STAT_CCA_FAIL_AAT_BIT_LEN    (1U)
#define FINT_STAT_CCA_FAIL_AAT_BIT_MASK   0x2U
#define FINT_STAT_TXOK_BIT_OFFSET         (0U)
#define FINT_STAT_TXOK_BIT_LEN            (1U)
#define FINT_STAT_TXOK_BIT_MASK           0x1U

/******************************************************************************
 * @brief Bit definitions for register INDIRECT_ADDR_A
 **/
#define INDIRECT_ADDR_A_ID   0x1F0004UL
#define INDIRECT_ADDR_A_LEN  (4U)
#define INDIRECT_ADDR_A_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register ADDR_OFFSET_A
 **/
#define ADDR_OFFSET_A_ID   0x1F0008UL
#define ADDR_OFFSET_A_LEN  (4U)
#define ADDR_OFFSET_A_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register INDIRECT_ADDR_B
 **/
#define INDIRECT_ADDR_B_ID   0x1F000CUL
#define INDIRECT_ADDR_B_LEN  (4U)
#define INDIRECT_ADDR_B_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register ADDR_OFFSET_B
 **/
#define ADDR_OFFSET_B_ID   0x1F0010UL
#define ADDR_OFFSET_B_LEN  (4U)
#define ADDR_OFFSET_B_MASK 0xFFFFFFFFUL

    /* **** Regmap version is None **** */

#ifdef __cplusplus
}
#endif
#endif /* DECA_REGS_DW3000_H */
